[
    {
        "text": "A good night’s sleep makes all the difference in how I feel the next day.",
        "translation": "Хороший ночной сон имеет решающее значение для моего самочувствия на следующий день.",
        "id": "7582f339"
    },
    {
        "text": "A little encouragement from a friend makes all the difference when you're feeling down.",
        "translation": "Небольшая поддержка друга имеет огромное значение, когда тебе грустно.",
        "id": "c03203f1"
    },
    {
        "text": "Using high-quality ingredients makes all the difference in cooking.",
        "translation": "Использование качественных ингредиентов имеет решающее значение в кулинарии.",
        "id": "d4520924"
    },
    {
        "text": "Wearing comfortable shoes makes all the difference when walking long distances.",
        "translation": "Удобная обувь имеет решающее значение при длительных прогулках.",
        "id": "2c5c5874"
    },
    {
        "text": "A little kindness can make all the difference in someone's day.",
        "translation": "Немного доброты может значительно изменить чей-то день к лучшему.",
        "id": "39277552"
    },
    {
        "text": "A positive attitude makes all the difference in overcoming challenges.",
        "translation": "Позитивный настрой играет ключевую роль в преодолении трудностей.",
        "id": "5fc099db"
    },
    {
        "text": "Having a great teacher makes all the difference in learning a new subject.",
        "translation": "Хороший учитель имеет огромное значение при изучении нового предмета.",
        "id": "3ca7f9c5"
    },
    {
        "text": "Drinking enough water makes all the difference in staying healthy.",
        "translation": "Достаточное употребление воды играет ключевую роль в поддержании здоровья.",
        "id": "4c8982d1"
    },
    {
        "text": "The right lighting makes all the difference in creating a cozy atmosphere.",
        "translation": "Правильное освещение играет решающую роль в создании уютной атмосферы.",
        "id": "33712d77"
    },
    {
        "text": "A well-organized workspace makes all the difference in productivity.",
        "translation": "Хорошо организованное рабочее место играет ключевую роль в продуктивности.",
        "id": "2e5c1327"
    },
    {
        "text": "Support from loved ones makes all the difference when facing difficulties.",
        "translation": "Поддержка близких играет решающую роль при столкновении с трудностями.",
        "id": "ad74d9a1"
    },
    {
        "text": "A small change in diet makes all the difference in how you feel.",
        "translation": "Небольшие изменения в питании могут значительно повлиять на самочувствие.",
        "id": "8f36ee32"
    },
    {
        "text": "Choosing the right words makes all the difference in communication.",
        "translation": "Выбор правильных слов играет ключевую роль в общении.",
        "id": "c83056c5"
    },
    {
        "text": "A few extra minutes of stretching makes all the difference before a workout.",
        "translation": "Несколько дополнительных минут растяжки имеют решающее значение перед тренировкой.",
        "id": "cf6e51a2"
    },
    {
        "text": "Having a clear goal makes all the difference in staying motivated.",
        "translation": "Четкая цель играет ключевую роль в поддержании мотивации.",
        "id": "bdc6a6d1"
    },
    {
        "text": "Proper time management makes all the difference in balancing work and personal life.",
        "translation": "Правильное управление временем имеет решающее значение для баланса между работой и личной жизнью.",
        "id": "38dff2d7"
    },
    {
        "text": "A small act of generosity makes all the difference in someone's life.",
        "translation": "Маленький акт щедрости может значительно изменить чью-то жизнь.",
        "id": "9aa15c09"
    },
    {
        "text": "A well-written resume makes all the difference in getting a job interview.",
        "translation": "Хорошо написанное резюме играет ключевую роль в получении приглашения на собеседование.",
        "id": "0a5a5026"
    },
    {
        "text": "Listening instead of just hearing makes all the difference in a relationship.",
        "translation": "Слушать, а не просто слышать, имеет решающее значение в отношениях.",
        "id": "d031807e"
    },
    {
        "text": "Taking a deep breath before responding makes all the difference in difficult conversations.",
        "translation": "Глубокий вдох перед ответом может значительно изменить ход сложного разговора.",
        "id": "dcb0f646"
    },
    {
        "text": "A little bit of planning makes all the difference in a successful trip.",
        "translation": "Немного планирования имеет решающее значение для успешного путешествия.",
        "id": "1b5be1ac"
    },
    {
        "text": "Waking up early makes all the difference in having a productive day.",
        "translation": "Ранний подъем играет ключевую роль в продуктивном дне.",
        "id": "735f320f"
    },
    {
        "text": "Taking a break when you're stressed makes all the difference in your mental health.",
        "translation": "Перерыв в моменты стресса играет ключевую роль для психического здоровья.",
        "id": "38857cac"
    },
    {
        "text": "A simple thank-you makes all the difference in making someone feel appreciated.",
        "translation": "Простое «спасибо» может значительно повлиять на то, чтобы человек почувствовал себя ценным.",
        "id": "08ddd354"
    },
    {
        "text": "Paying attention to details makes all the difference in creating a great first impression.",
        "translation": "Внимание к деталям играет ключевую роль в создании хорошего первого впечатления.",
        "id": "9cdf0840"
    }
]