[
    {
        "text": "By next year, I will have been working at this company for ten years.",
        "translation": "К следующему году я буду работать в этой компании уже десять лет.",
        "id": "9b156769"
    },
    {
        "text": "By the end of the month, I will have been preparing for this exam for six weeks.",
        "translation": "К концу месяца я буду готовиться к этому экзамену уже шесть недель.",
        "id": "cf41f643"
    },    
    {
        "text": "She will have been studying medicine for seven years by the time she graduates.",
        "translation": "К моменту выпуска она будет изучать медицину уже семь лет.",
        "id": "c643e5dc"
    },
    {
        "text": "They will have been living in New York for five years by next summer.",
        "translation": "К следующему лету они будут жить в Нью-Йорке уже пять лет.",
        "id": "268a21c4"
    },
    {
        "text": "By the time you arrive, we will have been waiting for two hours.",
        "translation": "К тому времени, как ты приедешь, мы будем ждать уже два часа.",
        "id": "58902127"
    },
    {
        "text": "He will have been running for three hours before the race ends.",
        "translation": "Он будет бежать уже три часа, прежде чем гонка закончится.",
        "id": "29ff8a16"
    },
    {
        "text": "By next month, she will have been working on her project for six months.",
        "translation": "К следующему месяцу она будет работать над своим проектом уже шесть месяцев.",
        "id": "a7f89bb5"
    },
    {
        "text": "We will have been traveling across Europe for two months by the time we return home.",
        "translation": "К моменту нашего возвращения домой мы будем путешествовать по Европе уже два месяца.",
        "id": "1c8a4851"
    },
    {
        "text": "How long will you have been learning Spanish by the end of this year?",
        "translation": "Как долго ты будешь изучать испанский к концу этого года?",
        "id": "67d36f84"
    },
    {
        "text": "By the time he gets promoted, he will have been working in this position for five years.",
        "translation": "К тому времени, как его повысят, он будет работать на этой должности уже пять лет.",
        "id": "6bfc096d"
    },
    {
        "text": "She will have been practicing yoga for ten years by next spring.",
        "translation": "К следующей весне она будет заниматься йогой уже десять лет.",
        "id": "295555d1"
    },
    {
        "text": "They will have been building the new bridge for three years by the time it is completed.",
        "translation": "К моменту завершения строительства они будут строить новый мост уже три года.",
        "id": "b906d105"
    },
    {
        "text": "By midnight, he will have been driving for ten hours straight.",
        "translation": "К полуночи он будет вести машину уже десять часов подряд.",
        "id": "460a10a3"
    },
    {
        "text": "How long will they have been working on the new software by the time it is released?",
        "translation": "Как долго они будут работать над новым программным обеспечением к моменту его выпуска?",
        "id": "57587b9b"
    },
    {
        "text": "By next weekend, we will have been decorating the house for a whole week.",
        "translation": "К следующему выходному мы будем украшать дом уже целую неделю.",
        "id": "63b7d243"
    },
    {
        "text": "She will have been teaching at the university for twenty years by the time she retires.",
        "translation": "К моменту выхода на пенсию она будет преподавать в университете уже двадцать лет.",
        "id": "1c54dbf7"
    },
    {
        "text": "By the time you finish your studies, you will have been studying for more than a decade.",
        "translation": "К моменту окончания учебы ты будешь учиться уже более десяти лет.",
        "id": "b33f5114"
    },
    {
        "text": "They will have been growing organic vegetables for five years by next autumn.",
        "translation": "К следующей осени они будут выращивать органические овощи уже пять лет.",
        "id": "84c298f9"
    },
    {
        "text": "How long will you have been training before the championship starts?",
        "translation": "Как долго ты будешь тренироваться до начала чемпионата?",
        "id": "199414c9"
    },
    {
        "text": "By the time we reach the mountain top, we will have been climbing for six hours.",
        "translation": "К тому времени, как мы достигнем вершины, мы будем подниматься уже шесть часов.",
        "id": "b81c39dc"
    },
    {
        "text": "She will have been writing her novel for a year by the time she finishes it.",
        "translation": "К тому времени, как она закончит роман, она будет писать его уже год.",
        "id": "9f03e44c"
    },
    {
        "text": "They will have been rehearsing for the concert for three months by the time they perform.",
        "translation": "К моменту выступления они будут репетировать концерт уже три месяца.",
        "id": "03bf5a60"
    },
    {
        "text": "By this time next year, I will have been working on my dream project for five years.",
        "translation": "К этому времени в следующем году я буду работать над своим проектом мечты уже пять лет.",
        "id": "66270f73"
    },
    {
        "text": "By the time she gives birth, she will have been pregnant for nine months.",
        "translation": "К моменту родов она будет беременна уже девять месяцев.",
        "id": "864dc15c"
    },
    {
        "text": "How long will they have been renovating their house by the time they move in?",
        "translation": "Как долго они будут ремонтировать свой дом к моменту переезда?",
        "id": "5b4c1b80"
    }
]