[
    {
        "text": "I was reading a book when you called me.",
        "translation": "Я читал книгу, когда ты мне позвонил.",
        "id": "3fa3960a"
    },
    {
        "text": "She was cooking dinner while I was setting the table.",
        "translation": "Она готовила ужин, пока я накрывал на стол.",
        "id": "13baec4a"
    },
    {
        "text": "They were playing football when it started to rain.",
        "translation": "Они играли в футбол, когда начался дождь.",
        "id": "b61d2a33"
    },
    {
        "text": "We were watching TV at 8 PM last night.",
        "translation": "Мы смотрели телевизор вчера в 8 вечера.",
        "id": "2da6d085"
    },
    {
        "text": "He was talking on the phone when the doorbell rang.",
        "translation": "Он разговаривал по телефону, когда зазвонил дверной звонок.",
        "id": "35361829"
    },
    {
        "text": "My parents were visiting my grandparents last weekend.",
        "translation": "Мои родители навещали моих бабушку и дедушку в прошлые выходные.",
        "id": "a06b36d0"
    },
    {
        "text": "She was learning how to drive when she had an accident.",
        "translation": "Она училась водить машину, когда попала в аварию.",
        "id": "f4b76d6e"
    },
    {
        "text": "They were building a new house when I last saw them.",
        "translation": "Они строили новый дом, когда я видел их в последний раз.",
        "id": "519a1087"
    },
    {
        "text": "I was feeling very tired after the long trip.",
        "translation": "Я чувствовал себя очень уставшим после долгой поездки.",
        "id": "70169085"
    },
    {
        "text": "He was always losing his keys when he was younger.",
        "translation": "Он постоянно терял свои ключи, когда был моложе.",
        "id": "80064e49"
    },
    {
        "text": "She was wearing a beautiful dress at the party.",
        "translation": "Она носила красивое платье на вечеринке.",
        "id": "c0cacfa2"
    },
    {
        "text": "We were staying in a hotel near the beach.",
        "translation": "Мы жили в отеле рядом с пляжем.",
        "id": "de18095e"
    },
    {
        "text": "They were planning a trip to Italy last summer.",
        "translation": "Они планировали поездку в Италию прошлым летом.",
        "id": "00dda88b"
    },
    {
        "text": "I was waiting for my friend at the café when he texted me.",
        "translation": "Я ждал своего друга в кафе, когда он мне написал.",
        "id": "057a584b"
    },
    {
        "text": "The kids were playing in the backyard all afternoon.",
        "translation": "Дети играли на заднем дворе весь день.",
        "id": "24462dec"
    },
    {
        "text": "She was taking a shower when the electricity went out.",
        "translation": "Она принимала душ, когда отключилось электричество.",
        "id": "47a1fb7f"
    },
    {
        "text": "We were moving to a new apartment when we found a better one.",
        "translation": "Мы переезжали в новую квартиру, когда нашли вариант получше.",
        "id": "2b9635f0"
    },
    {
        "text": "He was fixing his car when I arrived.",
        "translation": "Он чинил свою машину, когда я приехал.",
        "id": "f9164404"
    },
    {
        "text": "They were discussing an important business deal at that time.",
        "translation": "Они обсуждали важную деловую сделку в то время.",
        "id": "285cd70c"
    },
    {
        "text": "I was listening to music when my mom called me for dinner.",
        "translation": "Я слушал музыку, когда мама позвала меня на ужин.",
        "id": "6dc8a938"
    },
    {
        "text": "She was writing a letter while drinking coffee.",
        "translation": "Она писала письмо, попивая кофе.",
        "id": "09050c74"
    },
    {
        "text": "The sun was shining, and the birds were singing that morning.",
        "translation": "Солнце светило, а птицы пели в то утро.",
        "id": "d75a7a3f"
    },
    {
        "text": "We were waiting for the bus when we saw an accident.",
        "translation": "Мы ждали автобус, когда увидели аварию.",
        "id": "75b477e5"
    },
    {
        "text": "He was learning Spanish when he traveled to Spain.",
        "translation": "Он изучал испанский, когда поехал в Испанию.",
        "id": "08630956"
    },
    {
        "text": "They were having lunch at a restaurant when they met an old friend.",
        "translation": "Они обедали в ресторане, когда встретили старого друга.",
        "id": "92851dd5"
    }
]