[
    {
        "text": "He jumped the gun and submitted his application before the official announcement.",
        "translation": "Он поторопился и подал заявку ещё до официального объявления.",
        "id": "4e27e428"
    },
    {
        "text": "She jumped the gun by telling everyone about the promotion before it was confirmed.",
        "translation": "Она поспешила и рассказала всем о повышении, прежде чем оно было подтверждено.",
        "id": "5ef31011"
    },
    {
        "text": "The media jumped the gun by reporting election results before all votes were counted.",
        "translation": "СМИ поторопились и сообщили о результатах выборов, прежде чем были подсчитаны все голоса.",
        "id": "71af0a5e"
    },
    {
        "text": "I think you're jumping the gun by buying baby clothes before knowing the gender.",
        "translation": "Мне кажется, ты торопишься, покупая детскую одежду, ещё не зная пол ребёнка.",
        "id": "dc655029"
    },
    {
        "text": "He jumped the gun and started celebrating before the referee’s final whistle.",
        "translation": "Он поторопился и начал праздновать ещё до финального свистка судьи.",
        "id": "8e81cf32"
    },
    {
        "text": "She jumped the gun by accusing her coworker before knowing all the facts.",
        "translation": "Она поспешила с обвинениями в адрес коллеги, не зная всех фактов.",
        "id": "caf235a6"
    },
    {
        "text": "We don’t want to jump the gun and sign the contract before reviewing all the details.",
        "translation": "Мы не хотим торопиться и подписывать контракт, не изучив все детали.",
        "id": "610e0b53"
    },
    {
        "text": "He jumped the gun and booked a vacation before confirming his work leave.",
        "translation": "Он поторопился и забронировал отпуск, не подтвердив своё отсутствие на работе.",
        "id": "a6dcfef0"
    },
    {
        "text": "They jumped the gun by releasing the product before it was fully tested.",
        "translation": "Они поспешили и выпустили продукт до его полного тестирования.",
        "id": "46f749f1"
    },
    {
        "text": "She jumped the gun and told her parents about the engagement before her fiancé proposed.",
        "translation": "Она поспешила и рассказала родителям о помолвке, прежде чем её жених сделал предложение.",
        "id": "61911101"
    },
    {
        "text": "The team jumped the gun by celebrating victory before the game was over.",
        "translation": "Команда поторопилась и начала праздновать победу до окончания игры.",
        "id": "ebded55e"
    },
    {
        "text": "Don't jump the gun and quit your job before securing a new one.",
        "translation": "Не торопись увольняться, пока не найдёшь новую работу.",
        "id": "298651ae"
    },
    {
        "text": "He jumped the gun by making a decision without consulting his team.",
        "translation": "Он поспешил с решением, не посоветовавшись со своей командой.",
        "id": "84cb973c"
    },
    {
        "text": "She jumped the gun and told everyone about the project before getting approval.",
        "translation": "Она поспешила и рассказала всем о проекте, не получив одобрения.",
        "id": "8a0c69de"
    },
    {
        "text": "The stock market reacted sharply because investors jumped the gun on the news.",
        "translation": "Рынок акций резко отреагировал, потому что инвесторы поторопились с выводами.",
        "id": "fca004dd"
    },
    {
        "text": "We don't want to jump the gun and assume the deal is final before signing the papers.",
        "translation": "Мы не хотим торопиться и считать сделку завершённой до подписания документов.",
        "id": "9ba213c9"
    },
    {
        "text": "He jumped the gun by publishing the article before verifying the sources.",
        "translation": "Он поспешил и опубликовал статью, не проверив источники.",
        "id": "7953f0cf"
    },
    {
        "text": "They jumped the gun and announced the product launch before finishing development.",
        "translation": "Они поспешили и объявили о запуске продукта, не закончив его разработку.",
        "id": "5bcec5fb"
    },
    {
        "text": "She jumped the gun and bought a wedding dress before getting engaged.",
        "translation": "Она поторопилась и купила свадебное платье до помолвки.",
        "id": "9fa1a4c6"
    },
    {
        "text": "Don't jump the gun and assume he's guilty before hearing his side of the story.",
        "translation": "Не спеши с выводами и не считай его виновным, пока не услышишь его версию событий.",
        "id": "eb057b8e"
    },
    {
        "text": "The CEO jumped the gun by announcing layoffs before discussing with the board.",
        "translation": "Генеральный директор поспешил и объявил о сокращениях до обсуждения с советом директоров.",
        "id": "e19a3dbc"
    },
    {
        "text": "We jumped the gun and started celebrating our funding before the contract was signed.",
        "translation": "Мы поторопились и начали праздновать получение финансирования до подписания контракта.",
        "id": "65636166"
    },
    {
        "text": "He jumped the gun by quitting his studies before securing a job.",
        "translation": "Он поспешил и бросил учёбу, не найдя работу.",
        "id": "3bf2b80b"
    },
    {
        "text": "They jumped the gun and assumed the negotiations were successful before receiving confirmation.",
        "translation": "Они поспешили и решили, что переговоры прошли успешно, до получения подтверждения.",
        "id": "56ac6418"
    }
]