[
    {
        "text": "He left me in the lurch when I needed his support the most.",
        "translation": "Он бросил меня в беде, когда я больше всего нуждался в его поддержке.",
        "id": "790a023e"
    },
    {
        "text": "She felt betrayed when her best friend left her in the lurch.",
        "translation": "Она почувствовала себя преданной, когда её лучшая подруга оставила её в трудной ситуации.",
        "id": "062e8e80"
    },
    {
        "text": "The company left its employees in the lurch by shutting down without notice.",
        "translation": "Компания бросила своих сотрудников в беде, закрывшись без предупреждения.",
        "id": "007fe679"
    },
    {
        "text": "I can't believe he left us in the lurch just before the deadline!",
        "translation": "Не могу поверить, что он бросил нас в трудную минуту прямо перед дедлайном!",
        "id": "cb123a33"
    },
    {
        "text": "My car broke down, and my friend left me in the lurch by not showing up.",
        "translation": "Моя машина сломалась, а мой друг бросил меня в беде, не приехав.",
        "id": "9cdb43b7"
    },
    {
        "text": "Don't leave me in the lurch now – I really need your help!",
        "translation": "Не бросай меня в беде сейчас – мне очень нужна твоя помощь!",
        "id": "97e72fa8"
    },
    {
        "text": "They left us in the lurch by canceling the event at the last moment.",
        "translation": "Они бросили нас в беде, отменив мероприятие в последний момент.",
        "id": "e7801258"
    },
    {
        "text": "The manager left the team in the lurch by quitting unexpectedly.",
        "translation": "Менеджер бросил команду в трудную минуту, неожиданно уволившись.",
        "id": "a49d981a"
    },
    {
        "text": "She felt left in the lurch when her colleagues refused to back her up.",
        "translation": "Она почувствовала себя брошенной в трудную минуту, когда её коллеги отказались её поддержать.",
        "id": "64476f42"
    },
    {
        "text": "The government left the small businesses in the lurch during the crisis.",
        "translation": "Правительство бросило малый бизнес в беде во время кризиса.",
        "id": "2cdbc15b"
    },
    {
        "text": "We were left in the lurch when the contractor failed to finish the work.",
        "translation": "Нас бросили в беде, когда подрядчик не смог закончить работу.",
        "id": "23fe0b3c"
    },
    {
        "text": "He left his girlfriend in the lurch by breaking up with her right before their wedding.",
        "translation": "Он бросил свою девушку в беде, расставшись с ней прямо перед свадьбой.",
        "id": "f575af1f"
    },
    {
        "text": "You can’t leave your friends in the lurch when they count on you.",
        "translation": "Ты не можешь бросить своих друзей в беде, когда они рассчитывают на тебя.",
        "id": "65b07f1d"
    },
    {
        "text": "The airline left passengers in the lurch by canceling flights without compensation.",
        "translation": "Авиакомпания бросила пассажиров в беде, отменив рейсы без компенсации.",
        "id": "52d37f08"
    },
    {
        "text": "My business partner left me in the lurch by pulling out of the deal at the last second.",
        "translation": "Мой деловой партнер бросил меня в беде, выйдя из сделки в последнюю секунду.",
        "id": "f22c5b60"
    },
    {
        "text": "She didn't expect her assistant to leave her in the lurch during such an important presentation.",
        "translation": "Она не ожидала, что её ассистент бросит её в беде во время столь важной презентации.",
        "id": "b09a2ce8"
    },
    {
        "text": "The coach left the team in the lurch by quitting just before the final match.",
        "translation": "Тренер бросил команду в трудную минуту, уйдя в отставку прямо перед финальным матчем.",
        "id": "e4429200"
    },
    {
        "text": "The bank left its customers in the lurch by freezing their accounts.",
        "translation": "Банк бросил своих клиентов в беде, заморозив их счета.",
        "id": "8cb0aa2a"
    },
    {
        "text": "He promised to help, but he left us in the lurch when things got difficult.",
        "translation": "Он обещал помочь, но бросил нас в беде, когда стало трудно.",
        "id": "4bfb6983"
    },
    {
        "text": "She left her friend in the lurch by canceling their trip at the last minute.",
        "translation": "Она бросила свою подругу в беде, отменив их поездку в последнюю минуту.",
        "id": "5d9de153"
    },
    {
        "text": "The landlord left the tenants in the lurch by refusing to make necessary repairs.",
        "translation": "Арендодатель бросил жильцов в беде, отказавшись делать необходимые ремонты.",
        "id": "0df9822a"
    },
    {
        "text": "He left his brother in the lurch when he moved abroad without notice.",
        "translation": "Он бросил своего брата в беде, когда уехал за границу без предупреждения.",
        "id": "d6f59d1d"
    },
    {
        "text": "Our teacher left us in the lurch by not showing up for the exam review session.",
        "translation": "Наш учитель бросил нас в беде, не явившись на разбор экзамена.",
        "id": "598093ba"
    },
    {
        "text": "The tour guide left the group in the lurch by disappearing in a foreign city.",
        "translation": "Гид бросил группу в беде, исчезнув в чужом городе.",
        "id": "1b2f68a3"
    },
    {
        "text": "Her boyfriend left her in the lurch by refusing to help her move to a new apartment.",
        "translation": "Её парень бросил её в беде, отказавшись помочь с переездом в новую квартиру.",
        "id": "b52f9789"
    }
]