[
    {
        "text": "The new restaurant is not all it’s cracked up to be – the food was disappointing.",
        "translation": "Новый ресторан не такой уж хороший, как о нём говорят – еда была разочаровывающей.",
        "id": "65647528"
    },
    {
        "text": "Being famous is not all it’s cracked up to be; celebrities have very little privacy.",
        "translation": "Быть знаменитым не так уж круто, как кажется; у знаменитостей почти нет личной жизни.",
        "id": "0c3f646b"
    },
    {
        "text": "The job sounded amazing, but it’s not all it’s cracked up to be.",
        "translation": "Работа казалась потрясающей, но на самом деле всё не так радужно.",
        "id": "66a12e6f"
    },
    {
        "text": "Living in a big city is not all it’s cracked up to be – the traffic is a nightmare.",
        "translation": "Жить в большом городе не так уж классно, как кажется – пробки просто кошмарные.",
        "id": "fa4fccf0"
    },
    {
        "text": "The new phone is not all it’s cracked up to be; it has a lot of software issues.",
        "translation": "Новый телефон не такой уж хороший, как его рекламировали; у него много программных проблем.",
        "id": "c37eb962"
    },
    {
        "text": "Marriage is not all it’s cracked up to be if you’re not ready for commitment.",
        "translation": "Брак не так уж хорош, как кажется, если ты не готов к обязательствам.",
        "id": "109a8f9c"
    },
    {
        "text": "Working from home is not all it’s cracked up to be – it can get really lonely.",
        "translation": "Работать из дома не так уж здорово, как кажется – иногда становится очень одиноко.",
        "id": "d2e0dcec"
    },
    {
        "text": "College life is not all it’s cracked up to be; the workload is overwhelming.",
        "translation": "Студенческая жизнь не такая уж веселая, как кажется; учебная нагрузка огромная.",
        "id": "fa44f965"
    },
    {
        "text": "Owning a business is not all it’s cracked up to be – there’s so much stress involved.",
        "translation": "Владеть бизнесом не так уж круто, как кажется – это очень стрессово.",
        "id": "d3fff086"
    },
    {
        "text": "The vacation resort was not all it’s cracked up to be – the photos online were misleading.",
        "translation": "Этот курорт оказался не таким потрясающим, как его описывали – фотографии в интернете были обманчивыми.",
        "id": "7a05abff"
    },
    {
        "text": "Being rich is not all it’s cracked up to be – it comes with a lot of problems.",
        "translation": "Быть богатым не так уж прекрасно, как кажется – с этим приходит много проблем.",
        "id": "dd945963"
    },
    {
        "text": "The latest diet trend is not all it’s cracked up to be; I didn’t see any real results.",
        "translation": "Последний модный способ похудения оказался не таким эффективным, как его разрекламировали; я не увидел никаких реальных результатов.",
        "id": "be7a5a3e"
    },
    {
        "text": "Social media fame is not all it’s cracked up to be; it’s exhausting to keep up.",
        "translation": "Популярность в соцсетях не так уж хороша, как кажется; очень утомительно постоянно поддерживать активность.",
        "id": "1c2ca9c1"
    },
    {
        "text": "Living by the beach is not all it’s cracked up to be – the humidity ruins everything.",
        "translation": "Жить у моря не так уж замечательно, как кажется – высокая влажность портит всё.",
        "id": "d624cb16"
    },
    {
        "text": "Being your own boss is not all it’s cracked up to be; you work even harder than before.",
        "translation": "Быть самому себе начальником не так уж здорово – работаешь ещё больше, чем раньше.",
        "id": "bef5ff7b"
    },
    {
        "text": "The new theme park is not all it’s cracked up to be – the lines are way too long.",
        "translation": "Новый парк аттракционов не так уж хорош, как говорят – очереди слишком длинные.",
        "id": "397b6441"
    },
    {
        "text": "The latest fashion trend is not all it’s cracked up to be – it’s uncomfortable to wear.",
        "translation": "Последний модный тренд не такой уж классный, как кажется – в этой одежде неудобно.",
        "id": "825f3ef8"
    },
    {
        "text": "The five-star hotel was not all it’s cracked up to be – the service was terrible.",
        "translation": "Пятизвёздочный отель оказался не таким уж хорошим, как ожидалось – сервис был ужасным.",
        "id": "e17cb4ec"
    },
    {
        "text": "Luxury cars are not all they’re cracked up to be – maintenance costs a fortune.",
        "translation": "Люксовые машины не такие уж крутые, как кажется – их обслуживание стоит целое состояние.",
        "id": "d04afc0c"
    },
    {
        "text": "Being a professional athlete is not all it’s cracked up to be; the pressure is intense.",
        "translation": "Быть профессиональным спортсменом не так уж здорово, как кажется; давление огромное.",
        "id": "86e5298e"
    },
    {
        "text": "The famous restaurant was not all it’s cracked up to be – I’ve had better meals elsewhere.",
        "translation": "Знаменитый ресторан оказался не таким уж потрясающим – я ел в местах получше.",
        "id": "744b9de2"
    },
    {
        "text": "Online dating is not all it’s cracked up to be – it’s really hard to find a genuine connection.",
        "translation": "Онлайн-знакомства не такие уж классные, как кажется – очень сложно найти настоящую связь.",
        "id": "12c46cb5"
    },
    {
        "text": "Being an influencer is not all it’s cracked up to be – it’s a full-time job with no breaks.",
        "translation": "Быть инфлюенсером не так уж круто, как кажется – это полноценная работа без выходных.",
        "id": "92279406"
    },
    {
        "text": "Having the latest gadgets is not all it’s cracked up to be – they become outdated too fast.",
        "translation": "Иметь новейшие гаджеты не так уж круто, как кажется – они слишком быстро устаревают.",
        "id": "dcd26383"
    }
]