[
    {
        "text": "When I think of summer, the beach and ice cream spring to mind.",
        "translation": "Когда я думаю о лете, сразу приходят на ум пляж и мороженое.",
        "id": "8d03f900"
    },
    {
        "text": "His name didn’t come to mind until later in the conversation.",
        "translation": "Его имя не пришло мне в голову до более позднего момента в разговоре.",
        "id": "65911e7c"
    },
    {
        "text": "If you need a reliable mechanic, John springs to mind.",
        "translation": "Если тебе нужен надёжный механик, сразу приходит в голову Джон.",
        "id": "42299c21"
    },
    {
        "text": "When someone mentions Italian food, pizza and pasta come to mind first.",
        "translation": "Когда кто-то упоминает итальянскую кухню, первыми приходят на ум пицца и паста.",
        "id": "526643a7"
    },
    {
        "text": "A few ideas spring to mind, but I need more time to think them through.",
        "translation": "Несколько идей сразу приходят в голову, но мне нужно больше времени, чтобы их обдумать.",
        "id": "771d0a7d"
    },
    {
        "text": "What words come to mind when you think of success?",
        "translation": "Какие слова приходят на ум, когда ты думаешь об успехе?",
        "id": "5128a1f2"
    },
    {
        "text": "The first thing that springs to mind when I hear that song is my childhood.",
        "translation": "Первое, что приходит мне в голову, когда я слышу эту песню, — это моё детство.",
        "id": "77964fd7"
    },
    {
        "text": "When I think of adventure movies, Indiana Jones comes to mind.",
        "translation": "Когда я думаю о приключенческих фильмах, на ум приходит Индиана Джонс.",
        "id": "05e8105c"
    },
    {
        "text": "Whenever we talk about great leaders, Winston Churchill springs to mind.",
        "translation": "Когда мы говорим о великих лидерах, сразу приходит на ум Уинстон Черчилль.",
        "id": "cab030c3"
    },
    {
        "text": "What comes to mind when you think about your dream vacation?",
        "translation": "Что приходит тебе в голову, когда ты думаешь о своём идеальном отпуске?",
        "id": "712c83f3"
    },
    {
        "text": "When I need inspiration, a few good books always come to mind.",
        "translation": "Когда мне нужна мотивация, сразу приходят в голову несколько хороших книг.",
        "id": "b9ad7e20"
    },
    {
        "text": "If I say ‘fast food,’ what restaurant comes to mind first?",
        "translation": "Если я скажу «фастфуд», какой ресторан первым приходит тебе в голову?",
        "id": "500d01ab"
    },
    {
        "text": "Her face suddenly sprang to mind when I heard that name.",
        "translation": "Её лицо неожиданно всплыло в памяти, когда я услышал это имя.",
        "id": "6f2c7296"
    },
    {
        "text": "I couldn't remember the answer immediately, but after a moment, it came to mind.",
        "translation": "Я не смог сразу вспомнить ответ, но через некоторое время он пришёл мне в голову.",
        "id": "cbb93a78"
    },
    {
        "text": "Whenever I think about happiness, my family comes to mind.",
        "translation": "Когда я думаю о счастье, на ум приходит моя семья.",
        "id": "29f470b2"
    },
    {
        "text": "His generosity is the first thing that springs to mind when I think about him.",
        "translation": "Его щедрость — это первое, что приходит мне в голову, когда я думаю о нём.",
        "id": "5a790058"
    },
    {
        "text": "When you hear ‘innovation,’ which company comes to mind?",
        "translation": "Когда ты слышишь слово «инновации», какая компания первой приходит в голову?",
        "id": "8e1a02b0"
    },
    {
        "text": "The image of that beautiful sunset suddenly sprang to mind.",
        "translation": "Образ того прекрасного заката неожиданно всплыл в памяти.",
        "id": "dbdc0724"
    },
    {
        "text": "When I think of childhood memories, playing outside with my friends comes to mind.",
        "translation": "Когда я думаю о воспоминаниях детства, на ум приходит игра на улице с друзьями.",
        "id": "770bd975"
    },
    {
        "text": "I was struggling to come up with an idea, but then something suddenly sprang to mind.",
        "translation": "Я никак не мог придумать идею, но затем что-то неожиданно пришло мне в голову.",
        "id": "b3c69ddf"
    },
    {
        "text": "Whenever I think of kindness, my grandmother comes to mind.",
        "translation": "Когда я думаю о доброте, на ум приходит моя бабушка.",
        "id": "64f8ed54"
    },
    {
        "text": "If you need a creative solution, Sarah’s name always comes to mind.",
        "translation": "Если тебе нужно креативное решение, имя Сары всегда приходит в голову.",
        "id": "ed4fc6a1"
    },
    {
        "text": "I was trying to remember the name of that actor, and suddenly it sprang to mind!",
        "translation": "Я пытался вспомнить имя того актёра, и вдруг оно неожиданно всплыло в памяти!",
        "id": "6ac6864b"
    },
    {
        "text": "The phrase ‘hard work pays off’ comes to mind when I see how much effort you put in.",
        "translation": "Фраза «труд окупается» приходит мне в голову, когда я вижу, сколько усилий ты прилагаешь.",
        "id": "84ba8cd1"
    }
]