[
    {
        "text": "His business has grown in leaps and bounds over the past year.",
        "translation": "Его бизнес стремительно вырос за последний год.",
        "id": "5f7fea0c"
    },
    {
        "text": "Her confidence has improved by leaps and bounds since she started public speaking.",
        "translation": "Её уверенность в себе значительно выросла с тех пор, как она начала выступать на публике.",
        "id": "124758b1"
    },
    {
        "text": "Technology is advancing in leaps and bounds.",
        "translation": "Технологии развиваются стремительно.",
        "id": "703a473d"
    },
    {
        "text": "His English has improved by leaps and bounds since he moved to London.",
        "translation": "Его английский значительно улучшился с тех пор, как он переехал в Лондон.",
        "id": "e23e3634"
    },
    {
        "text": "The company's profits have increased in leaps and bounds.",
        "translation": "Прибыль компании выросла стремительно.",
        "id": "e0fbe718"
    },
    {
        "text": "Since she started practicing daily, her piano skills have progressed by leaps and bounds.",
        "translation": "С тех пор как она начала заниматься ежедневно, её навыки игры на пианино улучшились стремительно.",
        "id": "4bb5b0d6"
    },
    {
        "text": "Medical research is advancing in leaps and bounds.",
        "translation": "Медицинские исследования развиваются стремительно.",
        "id": "4faf708b"
    },
    {
        "text": "His fitness has improved by leaps and bounds since he joined the gym.",
        "translation": "Его физическая форма значительно улучшилась с тех пор, как он начал ходить в спортзал.",
        "id": "b2866708"
    },
    {
        "text": "Their relationship has grown in leaps and bounds since they started communicating openly.",
        "translation": "Их отношения значительно укрепились с тех пор, как они начали открыто общаться.",
        "id": "c79bf144"
    },
    {
        "text": "The city's infrastructure has developed in leaps and bounds over the past decade.",
        "translation": "Инфраструктура города стремительно развилась за последнее десятилетие.",
        "id": "ef370b6f"
    },
    {
        "text": "Her artistic skills have improved by leaps and bounds after taking professional lessons.",
        "translation": "Её художественные навыки значительно улучшились после профессиональных занятий.",
        "id": "7d952c9c"
    },
    {
        "text": "Thanks to online courses, his knowledge of programming has advanced by leaps and bounds.",
        "translation": "Благодаря онлайн-курсам его знания программирования стремительно развиваются.",
        "id": "6f9f5acd"
    },
    {
        "text": "Since the new management took over, productivity has increased in leaps and bounds.",
        "translation": "С тех пор как пришло новое руководство, продуктивность значительно выросла.",
        "id": "556750a8"
    },
    {
        "text": "Her cooking skills have improved by leaps and bounds since she started experimenting with new recipes.",
        "translation": "Её кулинарные навыки значительно улучшились с тех пор, как она начала экспериментировать с новыми рецептами.",
        "id": "6323bba8"
    },
    {
        "text": "The popularity of electric cars is growing in leaps and bounds.",
        "translation": "Популярность электромобилей стремительно растёт.",
        "id": "af240477"
    },
    {
        "text": "His ability to solve complex math problems has improved by leaps and bounds with regular practice.",
        "translation": "Его способность решать сложные математические задачи значительно улучшилась благодаря регулярной практике.",
        "id": "0b16e23e"
    },
    {
        "text": "Since the school introduced interactive learning methods, student engagement has increased in leaps and bounds.",
        "translation": "С тех пор как школа ввела интерактивные методы обучения, вовлечённость учеников значительно возросла.",
        "id": "23b6fddb"
    },
    {
        "text": "The development of artificial intelligence is progressing in leaps and bounds.",
        "translation": "Развитие искусственного интеллекта идёт стремительными темпами.",
        "id": "0eba4f42"
    },
    {
        "text": "Her self-esteem has grown by leaps and bounds since she started working on herself.",
        "translation": "Её самооценка значительно выросла с тех пор, как она начала работать над собой.",
        "id": "4fb97a18"
    },
    {
        "text": "The demand for organic food has increased in leaps and bounds.",
        "translation": "Спрос на органические продукты стремительно вырос.",
        "id": "06267bc4"
    },
    {
        "text": "Since the company upgraded its technology, efficiency has improved by leaps and bounds.",
        "translation": "С тех пор как компания обновила технологии, её эффективность значительно улучшилась.",
        "id": "41e3a2a1"
    },
    {
        "text": "His creativity has expanded in leaps and bounds since he started practicing mindfulness.",
        "translation": "Его креативность значительно возросла с тех пор, как он начал практиковать осознанность.",
        "id": "85b63862"
    },
    {
        "text": "The number of internet users worldwide has grown by leaps and bounds over the last decade.",
        "translation": "Количество пользователей интернета по всему миру стремительно выросло за последнее десятилетие.",
        "id": "196bc212"
    },
    {
        "text": "Her ability to handle stressful situations has improved by leaps and bounds since she started meditating.",
        "translation": "Её способность справляться со стрессовыми ситуациями значительно улучшилась с тех пор, как она начала медитировать.",
        "id": "ef4baf80"
    }
]