[
    {
        "text": "When left to their own devices, kids often come up with the most creative games.",
        "translation": "Когда детей оставляют предоставленными самим себе, они часто придумывают самые креативные игры.",
        "id": "444ff382"
    },
    {
        "text": "I decided to leave him to his own devices and see how he handled the situation.",
        "translation": "Я решил оставить его наедине с проблемой и посмотреть, как он справится.",
        "id": "9340256f"
    },
    {
        "text": "If you leave students to their own devices, some will work hard while others will get distracted.",
        "translation": "Если оставить студентов наедине с задачей, одни будут усердно работать, а другие отвлекутся.",
        "id": "dd9897a9"
    },
    {
        "text": "She prefers to be left to her own devices when working on a project.",
        "translation": "Она предпочитает, чтобы её оставляли в покое, когда она работает над проектом.",
        "id": "2b38eb1b"
    },
    {
        "text": "The manager left the employees to their own devices, trusting them to meet the deadline.",
        "translation": "Менеджер оставил сотрудников предоставленными самим себе, доверяя им соблюсти дедлайн.",
        "id": "3e13c385"
    },
    {
        "text": "When left to his own devices, he spends hours playing video games.",
        "translation": "Когда его оставляют одного, он часами играет в видеоигры.",
        "id": "89e3a0fe"
    },
    {
        "text": "We were left to our own devices during the camping trip and had to figure everything out ourselves.",
        "translation": "Во время похода нас оставили предоставленными самим себе, и нам пришлось разбираться во всём самостоятельно.",
        "id": "827363df"
    },
    {
        "text": "If you leave teenagers to their own devices, they might stay up all night.",
        "translation": "Если оставить подростков наедине с собой, они могут не спать всю ночь.",
        "id": "f366c5aa"
    },
    {
        "text": "The teacher left the students to their own devices and was surprised by their progress.",
        "translation": "Учитель оставил учеников работать самостоятельно и был удивлён их прогрессом.",
        "id": "08555a4d"
    },
    {
        "text": "I was left to my own devices on my first day at work, which was a bit overwhelming.",
        "translation": "Меня оставили одного разбираться в первый день на работе, и это было немного ошеломляюще.",
        "id": "c2f9555f"
    },
    {
        "text": "She enjoys being left to her own devices when she’s in the kitchen.",
        "translation": "Она любит, когда её оставляют одну на кухне.",
        "id": "dedfa895"
    },
    {
        "text": "Left to their own devices, the children turned the living room into a fort.",
        "translation": "Оставленные без присмотра, дети превратили гостиную в крепость.",
        "id": "741bdc4b"
    },
    {
        "text": "He was left to his own devices while his parents were away on vacation.",
        "translation": "Его оставили одного, пока родители были в отпуске.",
        "id": "25c5c4bf"
    },
    {
        "text": "We decided to leave the team to their own devices and see how they handled the task.",
        "translation": "Мы решили оставить команду работать самостоятельно и посмотреть, как они справятся с задачей.",
        "id": "25181631"
    },
    {
        "text": "If you leave a puppy to its own devices, expect some chewed-up furniture.",
        "translation": "Если оставить щенка одного, можно ожидать погрызенной мебели.",
        "id": "ad2048a4"
    },
    {
        "text": "They were left to their own devices after the instructor left the classroom.",
        "translation": "Их оставили предоставленными самим себе после того, как преподаватель вышел из класса.",
        "id": "d94e1c2d"
    },
    {
        "text": "When left to their own devices, employees can sometimes be more productive.",
        "translation": "Когда сотрудников оставляют работать самостоятельно, они иногда бывают более продуктивными.",
        "id": "0cc2ff07"
    },
    {
        "text": "She doesn’t mind being left to her own devices as she enjoys working independently.",
        "translation": "Она не возражает против того, чтобы её оставили работать самостоятельно, так как любит работать независимо.",
        "id": "4ed062cf"
    },
    {
        "text": "If left to his own devices, he would probably eat junk food all day.",
        "translation": "Если оставить его одного, он, вероятно, будет есть фастфуд весь день.",
        "id": "1446d2f4"
    },
    {
        "text": "The kids were left to their own devices while the parents attended a meeting.",
        "translation": "Детей оставили предоставленными самим себе, пока родители были на собрании.",
        "id": "ffaf88fa"
    },
    {
        "text": "When left to their own devices, the interns showed great problem-solving skills.",
        "translation": "Когда стажёров оставили работать самостоятельно, они проявили отличные навыки решения проблем.",
        "id": "50fc1aa6"
    },
    {
        "text": "The scientists were left to their own devices to develop the new experiment.",
        "translation": "Учёных оставили работать самостоятельно, чтобы они разработали новый эксперимент.",
        "id": "bfb0b064"
    },
    {
        "text": "He was left to his own devices in a foreign country and had to figure everything out himself.",
        "translation": "Его оставили одного в чужой стране, и ему пришлось разбираться во всём самому.",
        "id": "6922fb1f"
    },
    {
        "text": "When the teacher left the classroom, the students were left to their own devices.",
        "translation": "Когда учитель вышел из класса, ученики остались предоставленными самим себе.",
        "id": "42190d8e"
    },
    {
        "text": "I love being left to my own devices on a lazy Sunday afternoon.",
        "translation": "Я обожаю, когда меня оставляют одну в ленивое воскресное утро.",
        "id": "fdb12607"
    }
]