[
    {
        "text": "After losing his job, he found himself on the breadline.",
        "translation": "После потери работы он оказался на грани нищеты.",
        "id": "4f1ac6a5"
    },
    {
        "text": "Many families in the region are on the breadline due to the economic downturn.",
        "translation": "Многие семьи в этом регионе находятся на грани нищеты из-за экономического спада.",
        "id": "e09d695d"
    },
    {
        "text": "Despite working two jobs, she still finds herself on the breadline.",
        "translation": "Несмотря на работу на двух работах, она всё равно живет на грани нищеты.",
        "id": "4b76a2c5"
    },
    {
        "text": "The high cost of living in the city has put many residents on the breadline.",
        "translation": "Высокая стоимость жизни в городе поставила многих жителей на грани нищеты.",
        "id": "a086e068"
    },
    {
        "text": "After the divorce, he struggled financially and ended up on the breadline.",
        "translation": "После развода он столкнулся с финансовыми трудностями и оказался на грани нищеты.",
        "id": "5fce149a"
    },
    {
        "text": "Due to the recession, an increasing number of people are on the breadline.",
        "translation": "Из-за рецессии всё больше людей оказывается на грани нищеты.",
        "id": "480bc070"
    },
    {
        "text": "Many immigrants find it hard to adapt and often end up on the breadline.",
        "translation": "Многим иммигрантам трудно адаптироваться, и они часто оказываются на грани нищеты.",
        "id": "6cdf425b"
    },
    {
        "text": "The pandemic left countless families on the breadline, struggling to make ends meet.",
        "translation": "Пандемия оставила бесчисленное количество семей на грани нищеты, им приходилось изо всех сил пытаться свести концы с концами.",
        "id": "ce071506"
    },
    {
        "text": "After his business failed, he was forced to live on the breadline.",
        "translation": "После провала его бизнеса ему пришлось жить на грани нищеты.",
        "id": "869e3bb4"
    },
    {
        "text": "They live on a shoestring budget and are constantly on the breadline.",
        "translation": "Они живут на скудный бюджет и постоянно находятся на грани нищеты.",
        "id": "1ab779a1"
    },
    {
        "text": "Many elderly people are on the breadline, relying solely on their small pensions.",
        "translation": "Многие пожилые люди находятся на грани нищеты, полагаясь исключительно на свои небольшие пенсии.",
        "id": "2578f8a5"
    },
    {
        "text": "The skyrocketing housing prices have pushed several families onto the breadline.",
        "translation": "Небывалый рост цен на жильё вытеснил несколько семей на грань нищеты.",
        "id": "6b231b44"
    },
    {
        "text": "After losing his savings in a market crash, he ended up on the breadline.",
        "translation": "После того как он потерял свои сбережения на биржевом крахе, он оказался на грани нищеты.",
        "id": "a9dfc57b"
    },
    {
        "text": "Even with a full-time job, some people are on the breadline because of the rising cost of living.",
        "translation": "Даже имея работу на полный день, некоторые люди живут на грани нищеты из-за роста стоимости жизни.",
        "id": "70d0a0cb"
    },
    {
        "text": "The closure of the local factory left many workers on the breadline.",
        "translation": "Закрытие местного завода оставило многих рабочих на грани нищеты.",
        "id": "ff8061ee"
    },
    {
        "text": "His family has been on the breadline ever since the economic crisis began.",
        "translation": "Его семья находится на грани нищеты с тех пор, как начался экономический кризис.",
        "id": "56a70cdd"
    },
    {
        "text": "After the natural disaster, many residents were suddenly on the breadline.",
        "translation": "После стихийного бедствия многие жители внезапно оказались на грани нищеты.",
        "id": "e4148962"
    },
    {
        "text": "It's hard to imagine being on the breadline when you have a stable income.",
        "translation": "Трудно представить, что можно оказаться на грани нищеты, когда у тебя стабильный доход.",
        "id": "3dd9fd8f"
    },
    {
        "text": "Even a minor financial setback can push someone onto the breadline.",
        "translation": "Даже незначительная финансовая неудача может привести к тому, что человек окажется на грани нищеты.",
        "id": "1959d610"
    },
    {
        "text": "The rising unemployment rate means more people will soon be on the breadline.",
        "translation": "Рост уровня безработицы означает, что скоро всё больше людей окажется на грани нищеты.",
        "id": "b39ac1b6"
    },
    {
        "text": "Government assistance is vital for those who are on the breadline.",
        "translation": "Государственная помощь жизненно важна для тех, кто находится на грани нищеты.",
        "id": "8b371d56"
    },
    {
        "text": "After years of struggle, he finally managed to escape life on the breadline.",
        "translation": "После многих лет борьбы ему наконец удалось выбраться из состояния жизни на грани нищеты.",
        "id": "354cf132"
    },
    {
        "text": "Rising healthcare costs have forced several families onto the breadline.",
        "translation": "Рост затрат на здравоохранение вынудил несколько семей оказаться на грани нищеты.",
        "id": "410044a4"
    },
    {
        "text": "In many rural areas, poor harvests have left farmers on the breadline.",
        "translation": "Во многих сельских районах плохие урожаи оставили фермеров на грани нищеты.",
        "id": "9218ab5d"
    },
    {
        "text": "The charity's mission is to help those on the breadline get back on their feet.",
        "translation": "Миссия благотворительной организации – помочь тем, кто находится на грани нищеты, встать на ноги.",
        "id": "f419adeb"
    }
]