[
    {
        "text": "I feel like I’ve come up against a brick wall with this project.",
        "translation": "Я чувствую, что наткнулся на непреодолимое препятствие с этим проектом.",
        "id": "3ed4d1dc"
    },
    {
        "text": "She came up against a brick wall when she tried to get a promotion.",
        "translation": "Она столкнулась с серьезным препятствием, когда пыталась получить повышение.",
        "id": "d27f00f8"
    },
    {
        "text": "We came up against a brick wall while trying to solve the technical issue.",
        "translation": "Мы наткнулись на непреодолимое препятствие, пытаясь решить техническую проблему.",
        "id": "b5fa02b3"
    },
    {
        "text": "He came up against a brick wall when dealing with government bureaucracy.",
        "translation": "Он столкнулся с непреодолимым барьером при взаимодействии с государственной бюрократией.",
        "id": "b7d26e66"
    },
    {
        "text": "I’ve come up against a brick wall trying to find more information on the topic.",
        "translation": "Я наткнулся на стену, пытаясь найти больше информации по этой теме.",
        "id": "cf6af367"
    },
    {
        "text": "The investigation came up against a brick wall due to a lack of evidence.",
        "translation": "Расследование столкнулось с непреодолимым препятствием из-за нехватки доказательств.",
        "id": "e040e24d"
    },
    {
        "text": "She came up against a brick wall when she tried to change the company’s outdated policies.",
        "translation": "Она столкнулась с непреодолимым препятствием, когда пыталась изменить устаревшие правила компании.",
        "id": "4d619be2"
    },
    {
        "text": "I keep coming up against a brick wall whenever I try to negotiate a better deal.",
        "translation": "Я постоянно наталкиваюсь на непреодолимое препятствие, когда пытаюсь договориться о лучшей сделке.",
        "id": "0ebd19e4"
    },
    {
        "text": "They came up against a brick wall in their attempts to expand the business.",
        "translation": "Они столкнулись с серьезным препятствием в своих попытках расширить бизнес.",
        "id": "9bd7833c"
    },
    {
        "text": "We came up against a brick wall when the bank refused to approve our loan.",
        "translation": "Мы наткнулись на непреодолимое препятствие, когда банк отказался одобрить наш кредит.",
        "id": "a719cb19"
    },
    {
        "text": "His research came up against a brick wall when he couldn’t access the necessary data.",
        "translation": "Его исследование наткнулось на стену, когда он не смог получить доступ к необходимым данным.",
        "id": "5b22f90a"
    },
    {
        "text": "She came up against a brick wall when she tried to convince her parents to let her travel alone.",
        "translation": "Она столкнулась с непреодолимым сопротивлением, когда пыталась убедить родителей позволить ей путешествовать одной.",
        "id": "f46b0989"
    },
    {
        "text": "The company came up against a brick wall when legal issues halted their project.",
        "translation": "Компания наткнулась на непреодолимое препятствие, когда юридические вопросы остановили их проект.",
        "id": "517c8465"
    },
    {
        "text": "I've come up against a brick wall trying to fix this software bug.",
        "translation": "Я наткнулся на серьезную проблему, пытаясь исправить этот баг в программе.",
        "id": "27a1d50d"
    },
    {
        "text": "Every time I try to talk to my boss about a salary raise, I come up against a brick wall.",
        "translation": "Каждый раз, когда я пытаюсь поговорить с начальником о повышении зарплаты, я наталкиваюсь на стену.",
        "id": "d8b21eab"
    },
    {
        "text": "They came up against a brick wall in their search for a missing person.",
        "translation": "Они наткнулись на непреодолимое препятствие в поисках пропавшего человека.",
        "id": "97858b9d"
    },
    {
        "text": "The negotiations came up against a brick wall when neither side would compromise.",
        "translation": "Переговоры зашли в тупик, когда ни одна из сторон не захотела идти на компромисс.",
        "id": "ed0c154c"
    },
    {
        "text": "We've come up against a brick wall in our efforts to find a solution.",
        "translation": "Мы наткнулись на непреодолимое препятствие в наших попытках найти решение.",
        "id": "6a5fa0a1"
    },
    {
        "text": "His dream of becoming an actor came up against a brick wall when he failed multiple auditions.",
        "translation": "Его мечта стать актером наткнулась на непреодолимое препятствие, когда он провалил несколько прослушиваний.",
        "id": "62eee9ec"
    },
    {
        "text": "The police came up against a brick wall in their attempt to catch the suspect.",
        "translation": "Полиция столкнулась с непреодолимым препятствием в попытке поймать подозреваемого.",
        "id": "839eb103"
    },
    {
        "text": "I came up against a brick wall trying to learn a new programming language.",
        "translation": "Я наткнулся на стену, пытаясь выучить новый язык программирования.",
        "id": "de1a27f6"
    },
    {
        "text": "They came up against a brick wall when they realized the budget was too small to finish the project.",
        "translation": "Они столкнулись с непреодолимым препятствием, когда поняли, что бюджета недостаточно для завершения проекта.",
        "id": "8aa70445"
    },
    {
        "text": "Our marketing campaign came up against a brick wall due to a lack of funding.",
        "translation": "Наша маркетинговая кампания столкнулась с непреодолимым препятствием из-за нехватки финансирования.",
        "id": "06a33ccd"
    },
    {
        "text": "She came up against a brick wall when she tried to prove her innocence.",
        "translation": "Она наткнулась на стену, когда пыталась доказать свою невиновность.",
        "id": "eea84f37"
    },
    {
        "text": "The legal team came up against a brick wall while gathering evidence for the case.",
        "translation": "Юридическая команда столкнулась с непреодолимым препятствием, собирая доказательства по делу.",
        "id": "e4680851"
    }
]