[
    {
        "text": "Can you explain quantum physics in a nutshell?",
        "translation": "Можешь объяснить квантовую физику в двух словах?",
        "id": "d366823a"
    },
    {
        "text": "In a nutshell, the app helps people manage their time more effectively.",
        "translation": "В двух словах, приложение помогает людям эффективнее управлять своим временем.",
        "id": "a51ed05d"
    },
    {
        "text": "In a nutshell, the project was a huge success.",
        "translation": "Вкратце, проект был огромным успехом.",
        "id": "cf6e1c5e"
    },
    {
        "text": "The book is about climate change and its effects, in a nutshell.",
        "translation": "Книга о климатических изменениях и их последствиях, если вкратце.",
        "id": "86f1ab82"
    },
    {
        "text": "He described the company's mission in a nutshell during his presentation.",
        "translation": "Он описал миссию компании в двух словах во время своей презентации.",
        "id": "f9033df3"
    },
    {
        "text": "In a nutshell, their strategy is to expand into new markets.",
        "translation": "Вкратце, их стратегия заключается в выходе на новые рынки.",
        "id": "15209c03"
    },
    {
        "text": "The movie, in a nutshell, is about the power of friendship.",
        "translation": "Фильм, вкратце, о силе дружбы.",
        "id": "54c5b5d7"
    },
    {
        "text": "In a nutshell, the policy changes aim to improve efficiency.",
        "translation": "Если вкратце, изменения в политике направлены на повышение эффективности.",
        "id": "88a0c317"
    },
    {
        "text": "He summarized the entire book in a nutshell in just two sentences.",
        "translation": "Он кратко пересказал всю книгу всего за два предложения.",
        "id": "625f20e2"
    },
    {
        "text": "The meeting, in a nutshell, focused on budget planning.",
        "translation": "Если кратко, встреча была посвящена планированию бюджета.",
        "id": "3d2c479f"
    },
    {
        "text": "In a nutshell, we need to act quickly to resolve the issue.",
        "translation": "В двух словах, нам нужно быстро действовать, чтобы решить проблему.",
        "id": "961dfeee"
    },
    {
        "text": "The presentation, in a nutshell, highlighted the importance of innovation.",
        "translation": "Презентация, если кратко, подчеркивала важность инноваций.",
        "id": "6dccdae4"
    },
    {
        "text": "She explained the complex theory in a nutshell for the audience.",
        "translation": "Она объяснила сложную теорию вкратце для аудитории.",
        "id": "4add13cf"
    },
    {
        "text": "The article, in a nutshell, provides an overview of the situation.",
        "translation": "Статья, вкратце, даёт обзор ситуации.",
        "id": "62a03020"
    },
    {
        "text": "In a nutshell, the new software is faster and easier to use.",
        "translation": "Если вкратце, новое программное обеспечение быстрее и проще в использовании.",
        "id": "0f85ddca"
    },
    {
        "text": "He described the problem and its solution in a nutshell.",
        "translation": "Он описал проблему и её решение в двух словах.",
        "id": "8f913b6e"
    },
    {
        "text": "In a nutshell, the event was a celebration of community spirit.",
        "translation": "Если вкратце, мероприятие было праздником духа сообщества.",
        "id": "d9465eb5"
    },
    {
        "text": "The professor explained the topic in a nutshell to help students understand.",
        "translation": "Профессор объяснил тему вкратце, чтобы помочь студентам понять.",
        "id": "f4a73236"
    },
    {
        "text": "In a nutshell, the investment paid off handsomely.",
        "translation": "В двух словах, инвестиция оправдала себя с лихвой.",
        "id": "b36fe4cf"
    },
    {
        "text": "The news, in a nutshell, was both shocking and unexpected.",
        "translation": "Новости, если вкратце, были шокирующими и неожиданными.",
        "id": "d8d8043b"
    },
    {
        "text": "In a nutshell, the experiment confirmed their hypothesis.",
        "translation": "Если вкратце, эксперимент подтвердил их гипотезу.",
        "id": "f73f6664"
    },
    {
        "text": "She summarized the conference in a nutshell for her colleagues.",
        "translation": "Она кратко пересказала конференцию своим коллегам.",
        "id": "fb12d2ef"
    },
    {
        "text": "In a nutshell, the recipe requires only basic ingredients.",
        "translation": "Если вкратце, для рецепта нужны только базовые ингредиенты.",
        "id": "24f74cc0"
    },
    {
        "text": "The report, in a nutshell, indicates a need for urgent action.",
        "translation": "Отчёт, если вкратце, указывает на необходимость срочных действий.",
        "id": "5513a10d"
    },
    {
        "text": "In a nutshell, the play is about love and loss.",
        "translation": "Если вкратце, пьеса о любви и потерях.",
        "id": "a23ba757"
    }
]