[
    {
        "text": "We had eaten dinner by the time they called us.",
        "translation": "Мы поужинали к тому времени, как они нам позвонили.",
        "id": "27e8d9de"
    },
    {
        "text": "When I arrived at her house, she had already left.",
        "translation": "Когда я приехал к ней домой, она уже ушла.",
        "id": "9a0439e4"
    },
    {
        "text": "She had already left before we arrived.",
        "translation": "Она уже ушла до того, как мы приехали.",
        "id": "e5280723"
    },
    {
        "text": "By midnight, they had finished the project.",
        "translation": "К полуночи они закончили проект.",
        "id": "ac96fd16"
    },
    {
        "text": "She felt exhausted because she had worked all day.",
        "translation": "Она чувствовала себя измотанной, потому что работала весь день.",
        "id": "3d02b19d"
    },
    {
        "text": "The train had left by the time we got to the station.",
        "translation": "Поезд уже ушел к тому моменту, когда мы добрались до станции.",
        "id": "9f6c7b4c"
    },
    {
        "text": "He had just fallen asleep when the phone rang.",
        "translation": "Он только что заснул, когда зазвонил телефон.",
        "id": "040f1d98"
    },
    {
        "text": "After they had eaten, they went for a walk.",
        "translation": "После того, как они поели, они пошли на прогулку.",
        "id": "0c89c388"
    },
    {
        "text": "By 5 PM, I had completed my work.",
        "translation": "К 5 вечера я завершил свою работу.",
        "id": "cb6e6105"
    },
    {
        "text": "By the time I got to the store, they had sold out of my favorite snacks.",
        "translation": "К тому времени, как я добрался до магазина, мои любимые снеки уже распродали.",
        "id": "5b47c6b6"
    },
    {
        "text": "She had learned French before moving to Paris.",
        "translation": "Она выучила французский до переезда в Париж.",
        "id": "904a7af4"
    },
    {
        "text": "By the time the guests arrived, we had already set the table.",
        "translation": "К тому времени, как гости приехали, мы уже накрыли на стол.",
        "id": "60dfd6c4"
    },
    {
        "text": "They had cleaned the house before their parents came home.",
        "translation": "Они убрали дом до того, как их родители вернулись домой.",
        "id": "dd1ebc37"
    },
    {
        "text": "They had never seen such a beautiful sunset before.",
        "translation": "Они никогда раньше не видели такого красивого заката.",
        "id": "1ad862ea"
    },
    {
        "text": "She was very happy because she had passed her exam.",
        "translation": "Она была очень счастлива, потому что сдала экзамен.",
        "id": "c998c789"
    },
    {
        "text": "The sun had set before we reached the beach.",
        "translation": "Солнце уже село, прежде чем мы добрались до пляжа.",
        "id": "394dab44"
    },
    {
        "text": "I didn’t recognize him because he had grown a beard.",
        "translation": "Я его не узнал, потому что он отрастил бороду.",
        "id": "7f36da2c"
    },
    {
        "text": "She didn’t go to bed until she had finished her book.",
        "translation": "Она не легла спать, пока не дочитала книгу.",
        "id": "97294f6f"
    },
    {
        "text": "He had never been to New York before his business trip.",
        "translation": "Он никогда не был в Нью-Йорке до своей командировки.",
        "id": "379aaae2"
    },
    {
        "text": "By the time I woke up, my mother had already prepared breakfast.",
        "translation": "К тому времени, как я проснулся, мама уже приготовила завтрак.",
        "id": "9841af2c"
    },
    {
        "text": "She had packed her suitcase before the taxi arrived.",
        "translation": "Она собрала свой чемодан до приезда такси.",
        "id": "22821448"
    },
    {
        "text": "He had finished his test before the time was up.",
        "translation": "Он закончил тест до того, как время истекло.",
        "id": "099cdb06"
    },
    {
        "text": "By 3 PM, they had already signed the contract.",
        "translation": "К 3 часам дня они уже подписали контракт.",
        "id": "dc733034"
    },
    {
        "text": "I had never visited that museum before last year.",
        "translation": "Я никогда не посещал этот музей до прошлого года.",
        "id": "abe79eec"
    },
    {
        "text": "He had already packed his suitcase when the taxi arrived.",
        "translation": "Он уже собрал чемодан, когда приехало такси.",
        "id": "2cf039ab"
    }
]