[
    {
      "text": "I get a real kick out of watching horror movies late at night.",
      "translation": "Я получаю огромное удовольствие от просмотра фильмов ужасов поздно ночью."
    },
    {
      "text": "She gets a kick out of surprising her friends with unexpected gifts.",
      "translation": "Она получает удовольствие от того, что делает друзьям неожиданные подарки."
    },
    {
      "text": "He gets a real kick out of trying exotic foods.",
      "translation": "Он получает настоящее удовольствие от дегустации экзотических блюд."
    },
    {
      "text": "My grandfather gets a kick out of telling old war stories.",
      "translation": "Мой дедушка получает удовольствие, рассказывая старые военные истории."
    },
    {
      "text": "They get a kick out of playing pranks on each other.",
      "translation": "Они получают удовольствие от розыгрышей друг друга."
    },
    {
      "text": "I always get a kick out of watching my dog chase his own tail.",
      "translation": "Мне всегда доставляет удовольствие смотреть, как моя собака гоняется за своим хвостом."
    },
    {
      "text": "She gets a real kick out of traveling to new places.",
      "translation": "Она получает настоящее удовольствие от путешествий в новые места."
    },
    {
      "text": "He gets a kick out of fixing old cars and bringing them back to life.",
      "translation": "Он получает удовольствие от ремонта старых автомобилей и возвращения их к жизни."
    },
    {
      "text": "My little brother gets a kick out of scaring people with his silly masks.",
      "translation": "Мой младший брат получает удовольствие, пугая людей своими глупыми масками."
    },
    {
      "text": "I get a real kick out of solving difficult puzzles.",
      "translation": "Я получаю настоящее удовольствие от решения сложных головоломок."
    },
    {
      "text": "She gets a kick out of dancing in the rain.",
      "translation": "Она получает удовольствие от танцев под дождем."
    },
    {
      "text": "We get a kick out of watching funny cat videos online.",
      "translation": "Мы получаем удовольствие от просмотра смешных видео с котами в интернете."
    },
    {
      "text": "He gets a real kick out of winning board games against his friends.",
      "translation": "Он получает настоящее удовольствие от победы в настольных играх над друзьями."
    },
    {
      "text": "My grandma gets a kick out of baking cookies for the whole family.",
      "translation": "Моя бабушка получает удовольствие от выпекания печенья для всей семьи."
    },
    {
      "text": "She gets a kick out of learning new languages.",
      "translation": "Она получает удовольствие от изучения новых языков."
    },
    {
      "text": "I get a real kick out of teaching my little sister how to ride a bike.",
      "translation": "Я получаю настоящее удовольствие от того, что учу свою младшую сестру кататься на велосипеде."
    },
    {
      "text": "They get a kick out of dressing up in costumes for Halloween.",
      "translation": "Они получают удовольствие от того, что наряжаются в костюмы на Хэллоуин."
    },
    {
      "text": "He gets a kick out of making people laugh with his jokes.",
      "translation": "Он получает удовольствие от того, что смешит людей своими шутками."
    },
    {
      "text": "My mom gets a real kick out of gardening.",
      "translation": "Моя мама получает настоящее удовольствие от садоводства."
    },
    {
      "text": "I always get a kick out of watching fireworks on New Year's Eve.",
      "translation": "Я всегда получаю удовольствие от просмотра фейерверков в канун Нового года."
    },
    {
      "text": "She gets a kick out of singing karaoke with her friends.",
      "translation": "Она получает удовольствие от пения в караоке с друзьями."
    },
    {
      "text": "We get a real kick out of trying new extreme sports.",
      "translation": "Мы получаем настоящее удовольствие от пробования новых экстремальных видов спорта."
    },
    {
      "text": "He gets a kick out of collecting rare coins.",
      "translation": "Он получает удовольствие от коллекционирования редких монет."
    },
    {
      "text": "My dad gets a real kick out of watching old Western movies.",
      "translation": "Мой папа получает настоящее удовольствие от просмотра старых вестернов."
    },
    {
      "text": "I get a kick out of writing short stories and sharing them online.",
      "translation": "Я получаю удовольствие от написания коротких рассказов и публикации их в интернете."
    }
]