[
    {
        "text": "By next year, I will have finished my degree.",
        "translation": "К следующему году я закончу свою степень.",
        "id": "538bb395"
    },
    {
        "text": "She will have completed her book by the end of the month.",
        "translation": "Она завершит свою книгу к концу месяца.",
        "id": "9ec33dfa"
    },
    {
        "text": "By 2030, scientists will have developed new vaccines.",
        "translation": "К 2030 году ученые разработают новые вакцины.",
        "id": "29e192b0"
    },
    {
        "text": "He will have learned French before he moves to Paris.",
        "translation": "Он выучит французский до того, как переедет в Париж.",
        "id": "f9723faf"
    },
    {
        "text": "By the time you arrive, we will have prepared dinner.",
        "translation": "К тому времени, как ты приедешь, мы уже приготовим ужин.",
        "id": "e7aa13b9"
    },
    {
        "text": "They will have built the new bridge by next summer.",
        "translation": "Они построят новый мост к следующему лету.",
        "id": "40cafa68"
    },
    {
        "text": "In two years, I will have saved enough money for a car.",
        "translation": "Через два года я накоплю достаточно денег на машину.",
        "id": "a4cc9119"
    },
    {
        "text": "By midnight, she will have finished her report.",
        "translation": "К полуночи она закончит свой отчет.",
        "id": "809d1d10"
    },
    {
        "text": "He will have retired by the time he turns 60.",
        "translation": "Он выйдет на пенсию к тому моменту, когда ему исполнится 60.",
        "id": "29eff3b9"
    },
    {
        "text": "By tomorrow morning, the snow will have melted.",
        "translation": "К завтрашнему утру снег растает.",
        "id": "235ac46e"
    },
    {
        "text": "She will have visited ten countries by the end of the year.",
        "translation": "Она посетит десять стран к концу года.",
        "id": "960f62e0"
    },
    {
        "text": "By 5 PM, I will have finished all my meetings.",
        "translation": "К 5 вечера я закончу все свои встречи.",
        "id": "3f5b0b75"
    },
    {
        "text": "Before you wake up, I will have already left for work.",
        "translation": "До того, как ты проснешься, я уже уйду на работу.",
        "id": "bfe92dc5"
    },
    {
        "text": "By next Friday, they will have launched the new website.",
        "translation": "К следующей пятнице они запустят новый сайт.",
        "id": "05c9ca29"
    },
    {
        "text": "In five years, we will have expanded our business worldwide.",
        "translation": "Через пять лет мы расширим наш бизнес по всему миру.",
        "id": "49ee6f53"
    },
    {
        "text": "By the time she arrives, we will have decorated the house.",
        "translation": "К тому времени, когда она приедет, мы украсим дом.",
        "id": "6e25ea14"
    },
    {
        "text": "By next month, he will have published his first novel.",
        "translation": "К следующему месяцу он опубликует свой первый роман.",
        "id": "4d4ca77c"
    },
    {
        "text": "They will have repaired the road before winter starts.",
        "translation": "Они отремонтируют дорогу до наступления зимы.",
        "id": "4c28ca56"
    },
    {
        "text": "By the time we get to the station, the train will have left.",
        "translation": "К тому времени, как мы доберемся до станции, поезд уже уйдет.",
        "id": "c7d020e2"
    },
    {
        "text": "By the end of this week, I will have read this entire book.",
        "translation": "К концу этой недели я прочитаю всю эту книгу.",
        "id": "98e5c281"
    },
    {
        "text": "She will have graduated from university by next summer.",
        "translation": "Она окончит университет к следующему лету.",
        "id": "68b568e1"
    },
    {
        "text": "By next Christmas, we will have moved into our new house.",
        "translation": "К следующему Рождеству мы переедем в наш новый дом.",
        "id": "ddfd27a1"
    },
    {
        "text": "Before the meeting starts, they will have printed all the documents.",
        "translation": "До начала встречи они распечатают все документы.",
        "id": "33e16b03"
    },
    {
        "text": "By 2050, humans will have discovered life on another planet.",
        "translation": "К 2050 году люди откроют жизнь на другой планете.",
        "id": "52ef9692"
    },
    {
        "text": "By the end of today, I will have answered all my emails.",
        "translation": "К концу сегодняшнего дня я отвечу на все свои письма.",
        "id": "17446ea5"
    }
]