[
    {
        "text": "My grandmother is the salt of the earth—kind, hardworking, and always ready to help others.",
        "translation": "Моя бабушка — просто золото: добрая, трудолюбивая и всегда готова помочь другим.",
        "id": "e082bf46"
    },
    {
        "text": "The volunteers who work tirelessly to help the homeless are truly the salt of the earth.",
        "translation": "Волонтёры, которые неустанно помогают бездомным, действительно лучшие из лучших.",
        "id": "605dc690"
    },
    {
        "text": "He’s the salt of the earth—always honest, reliable, and humble.",
        "translation": "Он — человек с золотым сердцем: всегда честный, надёжный и скромный.",
        "id": "8cae5bb7"
    },
    {
        "text": "The farmers in this small village are the salt of the earth, working hard every day to feed the nation.",
        "translation": "Фермеры в этой маленькой деревне — настоящие труженики, каждый день усердно работающие, чтобы накормить страну.",
        "id": "a0758361"
    },
    {
        "text": "She may not be rich or famous, but she is the salt of the earth—always willing to lend a hand.",
        "translation": "Она может быть не богатой и не знаменитой, но она просто душа-человек — всегда готова помочь.",
        "id": "89220ed2"
    },
    {
        "text": "Firefighters who risk their lives to save others are the salt of the earth.",
        "translation": "Пожарные, которые рискуют жизнью, спасая других, — настоящие герои.",
        "id": "13166640"
    },
    {
        "text": "You can always count on Tom; he’s the salt of the earth.",
        "translation": "На Тома всегда можно положиться — он человек с золотым характером.",
        "id": "cc08a594"
    },
    {
        "text": "She’s the salt of the earth, always looking out for her friends and family.",
        "translation": "Она просто золото — всегда заботится о друзьях и семье.",
        "id": "aa13f94a"
    },
    {
        "text": "Teachers who dedicate their lives to educating children are the salt of the earth.",
        "translation": "Учителя, которые посвящают свою жизнь обучению детей, — лучшие из лучших.",
        "id": "c51e8161"
    },
    {
        "text": "Despite facing hardships, he remains the salt of the earth, always treating others with kindness and respect.",
        "translation": "Несмотря на трудности, он остаётся настоящим человеком — всегда добр и уважителен к другим.",
        "id": "72283fd3"
    },
    {
        "text": "She’s not flashy or arrogant, just the salt of the earth—down-to-earth and sincere.",
        "translation": "Она не любит хвастаться и зазнаваться, просто душевный и искренний человек.",
        "id": "593223d5"
    },
    {
        "text": "Those who dedicate their lives to helping others without expecting anything in return are the salt of the earth.",
        "translation": "Те, кто посвящает свою жизнь помощи другим, не ожидая ничего взамен, — настоящие герои.",
        "id": "8ff94e57"
    },
    {
        "text": "My parents are the salt of the earth; they taught me the value of honesty and hard work.",
        "translation": "Мои родители — лучшие из лучших, они научили меня ценить честность и трудолюбие.",
        "id": "255a210c"
    },
    {
        "text": "Despite his success, he remains humble and helpful—the true salt of the earth.",
        "translation": "Несмотря на успех, он остаётся скромным и отзывчивым — настоящий человек с золотым сердцем.",
        "id": "2d3127e4"
    },
    {
        "text": "The kind-hearted woman who runs the local shelter is the salt of the earth.",
        "translation": "Добросердечная женщина, которая управляет местным приютом, — просто золото.",
        "id": "e3152536"
    },
    {
        "text": "Doctors and nurses who work long hours to care for patients are the salt of the earth.",
        "translation": "Врачи и медсёстры, которые работают долгие часы, заботясь о пациентах, — настоящие герои.",
        "id": "24725f86"
    },
    {
        "text": "He’s always there when you need him—definitely the salt of the earth.",
        "translation": "Он всегда рядом, когда он нужен — настоящий человек с большим сердцем.",
        "id": "76ed80a9"
    },
    {
        "text": "The locals in this small town are the salt of the earth—hospitable, hardworking, and kind-hearted.",
        "translation": "Местные жители этого маленького городка — просто золото: гостеприимные, трудолюбивые и добросердечные.",
        "id": "7df6a24d"
    },
    {
        "text": "A good neighbor who helps without hesitation is the salt of the earth.",
        "translation": "Хороший сосед, который помогает без раздумий, — настоящий человек с золотым характером.",
        "id": "2fa878ff"
    },
    {
        "text": "She spends all her free time volunteering at the animal shelter—she’s the salt of the earth.",
        "translation": "Она проводит всё своё свободное время, помогая в приюте для животных — просто золото.",
        "id": "4698a7bc"
    },
    {
        "text": "The small business owners who support their communities are the salt of the earth.",
        "translation": "Владельцы малого бизнеса, которые поддерживают свои сообщества, — настоящие труженики.",
        "id": "4731295c"
    },
    {
        "text": "A true friend who stands by you through thick and thin is the salt of the earth.",
        "translation": "Настоящий друг, который остаётся рядом в любых обстоятельствах, — настоящий человек с большим сердцем.",
        "id": "a7661db0"
    },
    {
        "text": "His father was the salt of the earth—a simple man with a strong moral compass.",
        "translation": "Его отец был человеком с золотым характером — простым, но с крепкими моральными принципами.",
        "id": "f4a76109"
    },
    {
        "text": "People who dedicate their lives to making the world a better place are the salt of the earth.",
        "translation": "Люди, которые посвящают свою жизнь тому, чтобы сделать мир лучше, — настоящие герои.",
        "id": "8f7c5459"
    }
]