[
    {
        "text": "The constant noise from the construction site is driving me up the wall.",
        "translation": "Постоянный шум со стройки сводит меня с ума.",
        "id": "51599c8b"
    },
    {
        "text": "Her habit of tapping her pen on the desk drives me up the wall.",
        "translation": "Её привычка постукивать ручкой по столу сводит меня с ума.",
        "id": "470f5379"
    },
    {
        "text": "It drives me up the wall when people chew loudly.",
        "translation": "Меня сводит с ума, когда люди громко чавкают.",
        "id": "50396330"
    },
    {
        "text": "The slow internet connection is driving me up the wall!",
        "translation": "Медленный интернет сводит меня с ума!",
        "id": "c92d3874"
    },
    {
        "text": "Waiting in long lines always drives me up the wall.",
        "translation": "Ожидание в длинных очередях всегда сводит меня с ума.",
        "id": "0c444281"
    },
    {
        "text": "His constant complaining drives his coworkers up the wall.",
        "translation": "Его постоянные жалобы сводят его коллег с ума.",
        "id": "97759754"
    },
    {
        "text": "My little brother drives me up the wall with his endless questions.",
        "translation": "Мой младший брат сводит меня с ума своими бесконечными вопросами.",
        "id": "55a1ba3d"
    },
    {
        "text": "The dripping faucet is driving me up the wall!",
        "translation": "Капающий кран сводит меня с ума!",
        "id": "9aba9d59"
    },
    {
        "text": "She drives me up the wall when she takes forever to get ready.",
        "translation": "Она сводит меня с ума, когда слишком долго собирается.",
        "id": "5f3c7934"
    },
    {
        "text": "His bad jokes drive me up the wall.",
        "translation": "Его плохие шутки сводят меня с ума.",
        "id": "d043d0c0"
    },
    {
        "text": "Being stuck in traffic for hours drives me up the wall.",
        "translation": "Застрять в пробке на несколько часов сводит меня с ума.",
        "id": "7dee713f"
    },
    {
        "text": "The way he interrupts people drives me up the wall.",
        "translation": "То, как он перебивает людей, сводит меня с ума.",
        "id": "beba25a2"
    },
    {
        "text": "The kids’ constant screaming drives their parents up the wall.",
        "translation": "Постоянный крик детей сводит их родителей с ума.",
        "id": "75e5f3da"
    },
    {
        "text": "It drives me up the wall when people leave dirty dishes in the sink.",
        "translation": "Меня сводит с ума, когда люди оставляют грязную посуду в раковине.",
        "id": "0c1c64c2"
    },
    {
        "text": "Her indecisiveness drives me up the wall.",
        "translation": "Её нерешительность сводит меня с ума.",
        "id": "0930a8d4"
    },
    {
        "text": "His arrogance drives everyone up the wall.",
        "translation": "Его высокомерие сводит всех с ума.",
        "id": "d2a486e2"
    },
    {
        "text": "The neighbor's loud music late at night drives me up the wall.",
        "translation": "Громкая музыка соседа поздно ночью сводит меня с ума.",
        "id": "31649ae5"
    },
    {
        "text": "My boss’s constant micromanaging drives me up the wall.",
        "translation": "Постоянный контроль со стороны моего начальника сводит меня с ума.",
        "id": "25e355a5"
    },
    {
        "text": "It drives me up the wall when people talk during movies.",
        "translation": "Меня сводит с ума, когда люди разговаривают во время фильма.",
        "id": "60e17ef6"
    },
    {
        "text": "Her habit of always being late drives me up the wall.",
        "translation": "Её привычка постоянно опаздывать сводит меня с ума.",
        "id": "e3788ab2"
    },
    {
        "text": "The baby's crying all night drove them up the wall.",
        "translation": "Плач ребенка всю ночь свёл их с ума.",
        "id": "7335f834"
    },
    {
        "text": "His bad driving skills drive me up the wall.",
        "translation": "Его плохие навыки вождения сводят меня с ума.",
        "id": "21b473a6"
    },
    {
        "text": "The way he always changes his mind drives me up the wall.",
        "translation": "То, как он постоянно меняет своё мнение, сводит меня с ума.",
        "id": "20d8354c"
    },
    {
        "text": "Her constant texting during conversations drives me up the wall.",
        "translation": "Её постоянные переписки во время разговора сводят меня с ума.",
        "id": "c58ae8f3"
    },
    {
        "text": "The way he talks so loudly on the phone drives me up the wall.",
        "translation": "То, как он громко разговаривает по телефону, сводит меня с ума.",
        "id": "12f4688e"
    }
]