[
    {
        "text": "I will be working on my project at this time tomorrow.",
        "translation": "Завтра в это время я буду работать над своим проектом.",
        "id": "4f787c65"
    },
    {
        "text": "She will be cooking dinner when you arrive.",
        "translation": "Она будет готовить ужин, когда ты приедешь.",
        "id": "31f61887"
    },
    {
        "text": "They will be playing football at 5 PM.",
        "translation": "Они будут играть в футбол в 5 вечера.",
        "id": "38bff156"
    },
    {
        "text": "We will be watching a movie at this time next week.",
        "translation": "В это время на следующей неделе мы будем смотреть фильм.",
        "id": "cf2033fa"
    },
    {
        "text": "He will be studying for his exams all weekend.",
        "translation": "Он будет готовиться к экзаменам все выходные.",
        "id": "ae5754a5"
    },
    {
        "text": "By this time tomorrow, I will be flying to Paris.",
        "translation": "Завтра в это время я буду лететь в Париж.",
        "id": "a27b3307"
    },
    {
        "text": "She will be wearing a beautiful dress at the party.",
        "translation": "На вечеринке она будет носить красивое платье.",
        "id": "1a10e092"
    },
    {
        "text": "They will be traveling across Europe this summer.",
        "translation": "Этим летом они будут путешествовать по Европе.",
        "id": "cd1cd993"
    },
    {
        "text": "I will be waiting for you at the airport when your flight lands.",
        "translation": "Я буду ждать тебя в аэропорту, когда твой рейс приземлится.",
        "id": "47673747"
    },
    {
        "text": "At 9 AM, the employees will be having a meeting.",
        "translation": "В 9 утра сотрудники будут проводить собрание.",
        "id": "5f24bab0"
    },
    {
        "text": "She will be giving a speech at the conference.",
        "translation": "Она будет выступать с речью на конференции.",
        "id": "456a4e3e"
    },
    {
        "text": "We will be staying at a hotel near the beach.",
        "translation": "Мы будем останавливаться в отеле рядом с пляжем.",
        "id": "d789925e"
    },
    {
        "text": "This time next year, they will be celebrating their anniversary.",
        "translation": "В это время в следующем году они будут праздновать свою годовщину.",
        "id": "1b4c0709"
    },
    {
        "text": "Will you be using your laptop this evening?",
        "translation": "Ты будешь пользоваться своим ноутбуком сегодня вечером?",
        "id": "aed54d5a"
    },
    {
        "text": "By next Monday, I will be working in my new job.",
        "translation": "К следующему понедельнику я буду работать на новой работе.",
        "id": "233565fd"
    },
    {
        "text": "At 6 PM, she will be meeting her friends for dinner.",
        "translation": "В 6 вечера она будет встречаться с друзьями на ужин.",
        "id": "5cd67f72"
    },
    {
        "text": "Will they be staying with us during their visit?",
        "translation": "Они будут останавливаться у нас во время своего визита?",
        "id": "37570bc8"
    },
    {
        "text": "At this moment next week, we will be lying on the beach.",
        "translation": "В этот момент на следующей неделе мы будем лежать на пляже.",
        "id": "b90a1c00"
    },
    {
        "text": "He will be driving home when you call him.",
        "translation": "Он будет ехать домой, когда ты ему позвонишь.",
        "id": "2f6f5e18"
    },
    {
        "text": "Will you be joining us for the trip?",
        "translation": "Ты присоединишься к нам в поездке?",
        "id": "000a3a38"
    },
    {
        "text": "They will be discussing the new project at the meeting.",
        "translation": "Они будут обсуждать новый проект на встрече.",
        "id": "177a7184"
    },
    {
        "text": "We will be celebrating her birthday all day.",
        "translation": "Мы будем праздновать ее день рождения весь день.",
        "id": "994a6264"
    },
    {
        "text": "She will be taking care of the guests when they arrive.",
        "translation": "Она будет заботиться о гостях, когда они приедут.",
        "id": "1f0a4bc1"
    },
    {
        "text": "By the evening, I will be finishing my report.",
        "translation": "К вечеру я буду заканчивать свой отчет.",
        "id": "168aed85"
    },
    {
        "text": "At this time tomorrow, the kids will be playing in the park.",
        "translation": "Завтра в это время дети будут играть в парке.",
        "id": "2f66f07d"
    }
]