[
    {
        "text": "I didn’t want to apologize, but I had to bite the bullet and do it.",
        "translation": "Я не хотел извиняться, но мне пришлось стиснуть зубы и сделать это.",
        "id": "c3b953ea"
    },
    {
        "text": "She didn’t like the idea of moving, but she bit the bullet and packed her bags.",
        "translation": "Ей не нравилась идея переезда, но она стиснула зубы и собрала чемоданы.",
        "id": "b473a014"
    },
    {
        "text": "After months of pain, he decided to bite the bullet and have surgery.",
        "translation": "После месяцев боли он решил стиснуть зубы и согласиться на операцию.",
        "id": "9ae1f661"
    },
    {
        "text": "I hate public speaking, but I have to bite the bullet and give this presentation.",
        "translation": "Я ненавижу публичные выступления, но мне придётся стиснуть зубы и провести эту презентацию.",
        "id": "c1796285"
    },
    {
        "text": "She knew the exam would be tough, but she bit the bullet and studied all night.",
        "translation": "Она знала, что экзамен будет сложным, но стиснула зубы и училась всю ночь.",
        "id": "43d0b09a"
    },
    {
        "text": "He didn't want to ask for help, but he had to bite the bullet and do it.",
        "translation": "Он не хотел просить о помощи, но ему пришлось стиснуть зубы и сделать это.",
        "id": "bdbaf918"
    },
    {
        "text": "I finally bit the bullet and told my boss I needed a raise.",
        "translation": "Я наконец стиснул зубы и сказал начальнику, что мне нужно повышение зарплаты.",
        "id": "7e7e5655"
    },
    {
        "text": "She hated the idea of getting a tooth pulled, but she bit the bullet and went to the dentist.",
        "translation": "Ей не нравилась идея удалять зуб, но она стиснула зубы и пошла к стоматологу.",
        "id": "c00422e1"
    },
    {
        "text": "Moving to another country was scary, but he bit the bullet and did it.",
        "translation": "Переезд в другую страну был пугающим, но он стиснул зубы и сделал это.",
        "id": "02489ca9"
    },
    {
        "text": "I don’t enjoy working out, but I need to bite the bullet and go to the gym.",
        "translation": "Мне не нравится заниматься спортом, но мне нужно стиснуть зубы и пойти в зал.",
        "id": "2e23d435"
    },
    {
        "text": "She bit the bullet and finally broke up with her toxic boyfriend.",
        "translation": "Она стиснула зубы и наконец рассталась со своим токсичным парнем.",
        "id": "74b4ffac"
    },
    {
        "text": "Even though he was afraid of heights, he bit the bullet and went skydiving.",
        "translation": "Хотя он боялся высоты, он стиснул зубы и прыгнул с парашютом.",
        "id": "37034d0e"
    },
    {
        "text": "I hate waking up early, but I have to bite the bullet and start my day.",
        "translation": "Я ненавижу рано вставать, но мне приходится стиснуть зубы и начать день.",
        "id": "85732bae"
    },
    {
        "text": "She didn’t want to confront her boss, but she bit the bullet and spoke up.",
        "translation": "Она не хотела спорить с начальником, но стиснула зубы и высказалась.",
        "id": "4089cc50"
    },
    {
        "text": "I had to bite the bullet and pay for the expensive car repair.",
        "translation": "Мне пришлось стиснуть зубы и заплатить за дорогой ремонт машины.",
        "id": "8f9e88e9"
    },
    {
        "text": "After avoiding the dentist for years, he finally bit the bullet and made an appointment.",
        "translation": "После многих лет избегания стоматолога он наконец стиснул зубы и записался на приём.",
        "id": "01845787"
    },
    {
        "text": "She bit the bullet and accepted the difficult job offer.",
        "translation": "Она стиснула зубы и приняла сложное предложение о работе.",
        "id": "788967d8"
    },
    {
        "text": "They didn't want to sell their house, but they had to bite the bullet and do it.",
        "translation": "Они не хотели продавать дом, но им пришлось стиснуть зубы и сделать это.",
        "id": "0864ed08"
    },
    {
        "text": "I was nervous about getting my first tattoo, but I bit the bullet and went through with it.",
        "translation": "Я нервничал перед тем, как сделать первую татуировку, но стиснул зубы и сделал это.",
        "id": "0e6917e4"
    },
    {
        "text": "He didn’t want to fire his employee, but he had to bite the bullet and do it.",
        "translation": "Он не хотел увольнять сотрудника, но ему пришлось стиснуть зубы и сделать это.",
        "id": "08c6f730"
    },
    {
        "text": "She bit the bullet and told her parents she was moving out.",
        "translation": "Она стиснула зубы и сказала родителям, что съезжает.",
        "id": "78c26466"
    },
    {
        "text": "Even though he was afraid of rejection, he bit the bullet and asked her out.",
        "translation": "Хотя он боялся отказа, он стиснул зубы и пригласил её на свидание.",
        "id": "8ec8eae1"
    },
    {
        "text": "I don’t like dealing with paperwork, but I had to bite the bullet and fill out the forms.",
        "translation": "Я не люблю заниматься бумажной работой, но мне пришлось стиснуть зубы и заполнить все формы.",
        "id": "9876095d"
    },
    {
        "text": "She finally bit the bullet and started writing her book.",
        "translation": "Она наконец стиснула зубы и начала писать свою книгу.",
        "id": "cfde6d02"
    }
]