[
    {
        "text": "I helped my boss with a big project, so now I’m in his good books.",
        "translation": "Я помог начальнику с важным проектом, так что теперь я у него на хорошем счету.",
        "id": "400dfd44"
    },
    {
        "text": "She brought coffee for everyone in the office, and now she’s in the manager’s good books.",
        "translation": "Она принесла кофе для всех в офисе, и теперь она в хороших отношениях с менеджером.",
        "id": "f2e5c94e"
    },
    {
        "text": "After volunteering for extra work, he’s definitely in his teacher’s good books.",
        "translation": "После того как он вызвался сделать дополнительную работу, он определённо у учителя на хорошем счету.",
        "id": "1727fd0e"
    },
    {
        "text": "My sister is in our parents’ good books because she always helps around the house.",
        "translation": "Моя сестра на хорошем счету у родителей, потому что всегда помогает по дому.",
        "id": "f97990f9"
    },
    {
        "text": "He returned the borrowed money on time, so now he’s in his friend’s good books again.",
        "translation": "Он вовремя вернул взятые в долг деньги, так что теперь снова в хороших отношениях с другом.",
        "id": "a53d7864"
    },
    {
        "text": "I completed my tasks ahead of schedule, and now I’m in my boss’s good books.",
        "translation": "Я завершил задания раньше срока, и теперь начальник доволен мной.",
        "id": "b2c1e08b"
    },
    {
        "text": "She’s in her coach’s good books after scoring the winning goal.",
        "translation": "Она на хорошем счету у тренера после того, как забила победный гол.",
        "id": "e9414de9"
    },
    {
        "text": "Bringing homemade cookies to the office put her in everyone’s good books.",
        "translation": "Принесённое ею домашнее печенье сделало её любимицей в офисе.",
        "id": "fde28b51"
    },
    {
        "text": "I finally fixed the Wi-Fi at home, so now I’m in my family’s good books.",
        "translation": "Я наконец-то починил Wi-Fi дома, так что теперь я на хорошем счету у семьи.",
        "id": "b3bb30ca"
    },
    {
        "text": "He’s been in the teacher’s good books ever since he started helping his classmates.",
        "translation": "Он находится на хорошем счету у учителя с тех пор, как начал помогать одноклассникам.",
        "id": "1b423c0d"
    },
    {
        "text": "She’s in her neighbor’s good books after helping take care of their plants while they were away.",
        "translation": "Она в хороших отношениях с соседями после того, как помогала ухаживать за их растениями в их отсутствие.",
        "id": "fa32b2fb"
    },
    {
        "text": "My coworker covered for me while I was sick, so he’s definitely in my good books now.",
        "translation": "Мой коллега подменил меня, пока я болел, так что теперь он точно у меня на хорошем счету.",
        "id": "3da11c0c"
    },
    {
        "text": "After organizing a surprise birthday party, she’s in her best friend’s good books.",
        "translation": "После организации вечеринки-сюрприза она на хорошем счету у своей лучшей подруги.",
        "id": "33fc78d2"
    },
    {
        "text": "He stayed late to help with the presentation, so now he’s in the boss’s good books.",
        "translation": "Он задержался, чтобы помочь с презентацией, так что теперь начальник им доволен.",
        "id": "dcb4106b"
    },
    {
        "text": "My younger brother did all his chores without being asked, so he’s in our parents’ good books.",
        "translation": "Мой младший брат сделал все свои обязанности по дому без напоминаний, так что теперь он в почёте у родителей.",
        "id": "8cf25e8a"
    },
    {
        "text": "She complimented her professor’s research, and now she’s in his good books.",
        "translation": "Она похвалила исследования профессора, и теперь он хорошо к ней относится.",
        "id": "8aa13cec"
    },
    {
        "text": "By helping with the charity event, he’s put himself in the community’s good books.",
        "translation": "Помогая с благотворительным мероприятием, он заработал хорошую репутацию в сообществе.",
        "id": "b8b39e9b"
    },
    {
        "text": "I apologized for my mistake and corrected it quickly, so now I’m back in my manager’s good books.",
        "translation": "Я извинился за свою ошибку и быстро её исправил, так что теперь снова на хорошем счету у менеджера.",
        "id": "d22e05c1"
    },
    {
        "text": "She gave her parents a thoughtful gift, putting herself in their good books.",
        "translation": "Она сделала родителям продуманный подарок, чем заслужила их расположение.",
        "id": "7472641e"
    },
    {
        "text": "He’s in his landlord’s good books after paying the rent early.",
        "translation": "Он на хорошем счету у хозяина квартиры после того, как заплатил аренду заранее.",
        "id": "fbad7466"
    },
    {
        "text": "I helped my neighbor shovel snow, and now I’m in his good books.",
        "translation": "Я помог соседу расчистить снег, и теперь он ко мне хорошо относится.",
        "id": "7205b7ad"
    },
    {
        "text": "Bringing coffee for the team put her in everyone’s good books at work.",
        "translation": "Принесённый ей кофе для команды сделал её любимицей на работе.",
        "id": "13e7836a"
    },
    {
        "text": "My friend gave me great advice when I needed it most, so he’s definitely in my good books.",
        "translation": "Мой друг дал мне отличный совет, когда он был мне нужен больше всего, так что теперь он у меня на хорошем счету.",
        "id": "20f4f61a"
    },
    {
        "text": "She covered my shift at work, so she’s in my good books now.",
        "translation": "Она подменила меня на работе, так что теперь я ей очень благодарен.",
        "id": "6c102c9e"
    }
]