[
    {
        "text": "If I won the lottery, I would travel around the world.",
        "translation": "Если бы я выиграл в лотерею, я бы путешествовал по всему миру.",
        "id": "93b1c837"
    },
    {
        "text": "If she studied harder, she would get better grades.",
        "translation": "Если бы она училась усерднее, она бы получала лучшие оценки.",
        "id": "b51ab820"
    },
    {
        "text": "If they lived closer, we would visit them more often.",
        "translation": "Если бы они жили ближе, мы бы навещали их чаще.",
        "id": "7e50cee5"
    },
    {
        "text": "If he had more time, he would learn to play the guitar.",
        "translation": "Если бы у него было больше времени, он бы научился играть на гитаре.",
        "id": "6e08f982"
    },
    {
        "text": "If we had a bigger house, we would invite more guests.",
        "translation": "Если бы у нас был дом побольше, мы бы приглашали больше гостей.",
        "id": "425fdca4"
    },
    {
        "text": "If I knew French, I would move to Paris.",
        "translation": "Если бы я знал французский, я бы переехал в Париж.",
        "id": "bfe926e7"
    },
    {
        "text": "If she didn’t work so much, she would have more free time.",
        "translation": "Если бы она не работала так много, у нее было бы больше свободного времени.",
        "id": "030d2e22"
    },
    {
        "text": "If they were taller, they could play basketball professionally.",
        "translation": "Если бы они были выше, они могли бы играть в баскетбол профессионально.",
        "id": "9c7c2de3"
    },
    {
        "text": "If I had a car, I would drive to work.",
        "translation": "Если бы у меня была машина, я бы ездил на работу на ней.",
        "id": "d4429757"
    },
    {
        "text": "If he didn’t eat so much junk food, he would be healthier.",
        "translation": "Если бы он не ел столько фастфуда, он был бы здоровее.",
        "id": "32b2c404"
    },
    {
        "text": "Unless you helped me, I wouldn’t be able to finish this project.",
        "translation": "Если бы ты мне не помог, я бы не смог закончить этот проект.",
        "id": "55b72cda"
    },
    {
        "text": "If we didn’t waste so much time, we would be more productive.",
        "translation": "Если бы мы не тратили столько времени впустую, мы были бы продуктивнее.",
        "id": "f34aee5e"
    },
    {
        "text": "If I could choose any job, I would become an astronaut.",
        "translation": "Если бы я мог выбрать любую работу, я бы стал астронавтом.",
        "id": "e505723f"
    },
    {
        "text": "If she wasn’t afraid of heights, she would go skydiving.",
        "translation": "Если бы она не боялась высоты, она бы прыгнула с парашютом.",
        "id": "e3186ca2"
    },
    {
        "text": "If you were more patient, you would be a great teacher.",
        "translation": "Если бы ты был терпеливее, ты был бы отличным учителем.",
        "id": "9426adf2"
    },
    {
        "text": "Provided that I had more money, I would buy a bigger house.",
        "translation": "При условии, что у меня было бы больше денег, я бы купил дом побольше.",
        "id": "3b184114"
    },
    {
        "text": "If I met my favorite celebrity, I would ask for a selfie.",
        "translation": "Если бы я встретил свою любимую знаменитость, я бы попросил сделать селфи.",
        "id": "2fef850d"
    },
    {
        "text": "If he didn’t spend so much time on his phone, he would read more books.",
        "translation": "Если бы он не проводил столько времени в телефоне, он бы читал больше книг.",
        "id": "338fcc6f"
    },
    {
        "text": "If she spoke Japanese, she would work in Tokyo.",
        "translation": "Если бы она говорила по-японски, она бы работала в Токио.",
        "id": "40582bcf"
    },
    {
        "text": "Supposing you won a million dollars, what would you do?",
        "translation": "Предположим, ты выиграл миллион долларов, что бы ты сделал?",
        "id": "3629183e"
    },
    {
        "text": "If we had a boat, we would sail to an island.",
        "translation": "Если бы у нас была лодка, мы бы поплыли на остров.",
        "id": "df99fc27"
    },
    {
        "text": "If I were a superhero, I would fly around the city.",
        "translation": "Если бы я был супергероем, я бы летал по городу.",
        "id": "f66f824b"
    },
    {
        "text": "If they practiced more, they would be better at playing the piano.",
        "translation": "Если бы они больше практиковались, они бы лучше играли на пианино.",
        "id": "e3527903"
    },
    {
        "text": "If you exercised regularly, you would feel much better.",
        "translation": "Если бы ты регулярно занимался спортом, ты бы чувствовал себя намного лучше.",
        "id": "616ff50e"
    },
    {
        "text": "In case you needed help, I would be there for you.",
        "translation": "В случае, если бы тебе понадобилась помощь, я был бы рядом.",
        "id": "b99e64e2"
    }
]