[
    {
        "text": "If it rains tomorrow, we will stay at home.",
        "translation": "Если завтра пойдет дождь, мы останемся дома.",
        "id": "37714fab"
    },
    {
        "text": "If she studies hard, she will pass the exam.",
        "translation": "Если она будет усердно учиться, она сдаст экзамен.",
        "id": "0c1fe66c"
    },
    {
        "text": "When you arrive, we will start the meeting.",
        "translation": "Когда ты приедешь, мы начнем собрание.",
        "id": "6ae625d2"
    },
    {
        "text": "Unless you hurry, you will miss the train.",
        "translation": "Если ты не поторопишься, ты опоздаешь на поезд.",
        "id": "21a686f3"
    },
    {
        "text": "If they leave now, they will catch the train.",
        "translation": "Если они уйдут сейчас, они успеют на поезд.",
        "id": "28201bd0"
    },
    {
        "text": "If you eat too much, you will feel sick.",
        "translation": "Если ты съешь слишком много, тебе станет плохо.",
        "id": "107efdc5"
    },
    {
        "text": "If we don’t hurry, we will miss the bus.",
        "translation": "Если мы не поторопимся, мы опоздаем на автобус.",
        "id": "e23bc0ae"
    },
    {
        "text": "As soon as she finishes work, she will call you.",
        "translation": "Как только она закончит работу, она тебе позвонит.",
        "id": "e252d4ee"
    },
    {
        "text": "Unless you wear a jacket, you will feel cold.",
        "translation": "Если ты не наденешь куртку, тебе будет холодно.",
        "id": "6be535f2"
    },
    {
        "text": "If I finish my work early, I will go for a walk.",
        "translation": "Если я закончу работу рано, я пойду на прогулку.",
        "id": "7486057a"
    },
    {
        "text": "If she invites me, I will come to the party.",
        "translation": "Если она меня пригласит, я приду на вечеринку.",
        "id": "75ea6869"
    },
    {
        "text": "If you study well, you will get good grades.",
        "translation": "Если ты будешь хорошо учиться, ты получишь хорошие оценки.",
        "id": "cb744326"
    },
    {
        "text": "Provided that you follow the instructions, everything will be fine.",
        "translation": "При условии, что ты будешь следовать инструкциям, все будет хорошо.",
        "id": "72fc32cd"
    },
    {
        "text": "If they arrive late, we will start without them.",
        "translation": "Если они опоздают, мы начнем без них.",
        "id": "4cacb12e"
    },
    {
        "text": "In case you need help, call me.",
        "translation": "В случае, если тебе понадобится помощь, позвони мне.",
        "id": "84959e7c"
    },
    {
        "text": "If I don’t set an alarm, I will oversleep.",
        "translation": "Если я не поставлю будильник, я просплю.",
        "id": "5b8b4294"
    },
    {
        "text": "Before you go out, you will need to lock the door.",
        "translation": "Перед тем, как выйти, тебе нужно будет запереть дверь.",
        "id": "233ff9d6"
    },
    {
        "text": "After she gets home, she will start cooking dinner.",
        "translation": "После того, как она придет домой, она начнет готовить ужин.",
        "id": "a4b64445"
    },
    {
        "text": "If we book the tickets now, we will get a discount.",
        "translation": "Если мы забронируем билеты сейчас, мы получим скидку.",
        "id": "7821b585"
    },
    {
        "text": "Unless she works late, she will join us for dinner.",
        "translation": "Если она не будет работать допоздна, она присоединится к нам на ужин.",
        "id": "daae3f9f"
    },
    {
        "text": "If you leave the door open, the cat will run away.",
        "translation": "Если ты оставишь дверь открытой, кошка убежит.",
        "id": "02ea25be"
    },
    {
        "text": "On condition that you help me, I will help you in return.",
        "translation": "При условии, что ты поможешь мне, я помогу тебе в ответ.",
        "id": "0b012925"
    },
    {
        "text": "If you take a taxi, you will get there faster.",
        "translation": "Если ты возьмешь такси, ты доберешься туда быстрее.",
        "id": "41312a62"
    },
    {
        "text": "When the movie ends, we will go to a restaurant.",
        "translation": "Когда фильм закончится, мы пойдем в ресторан.",
        "id": "d5736d0a"
    },
    {
        "text": "If she eats less sugar, she will feel better.",
        "translation": "Если она будет есть меньше сахара, она почувствует себя лучше.",
        "id": "34dcf80d"
    }
]