[
    {
        "text": "The two politicians are at loggerheads over the new tax policy.",
        "translation": "Два политика не могут прийти к согласию по поводу новой налоговой политики.",
        "id": "e5b7e83a"
    },
    {
        "text": "My parents are at loggerheads about where to go on vacation this year.",
        "translation": "Мои родители спорят о том, куда поехать в отпуск в этом году.",
        "id": "c0e37a1e"
    },
    {
        "text": "The two companies are at loggerheads over the rights to the technology.",
        "translation": "Две компании находятся в жёстком конфликте из-за прав на технологию.",
        "id": "3f26bd8f"
    },
    {
        "text": "She’s at loggerheads with her boss about the new work schedule.",
        "translation": "Она в конфликте с начальником из-за нового рабочего графика.",
        "id": "8b7a3ebf"
    },
    {
        "text": "The neighbors have been at loggerheads for years over the property boundary.",
        "translation": "Соседи уже много лет спорят из-за границы участка.",
        "id": "710eb45b"
    },
    {
        "text": "The two scientists are at loggerheads about how to interpret the data.",
        "translation": "Два учёных спорят о том, как интерпретировать данные.",
        "id": "3f03ea53"
    },
    {
        "text": "They’ve been at loggerheads since they started working together.",
        "translation": "Они находятся в постоянном конфликте с тех пор, как начали работать вместе.",
        "id": "7914b4db"
    },
    {
        "text": "The two football clubs are at loggerheads over a controversial referee decision.",
        "translation": "Два футбольных клуба в конфликте из-за спорного решения судьи.",
        "id": "d3e5ac91"
    },
    {
        "text": "My siblings and I are at loggerheads about how to divide our parents' inheritance.",
        "translation": "Мои братья и сёстры спорят о том, как разделить наследство родителей.",
        "id": "1195caf7"
    },
    {
        "text": "The teachers' union is at loggerheads with the government over salary increases.",
        "translation": "Профсоюз учителей находится в жёстком противостоянии с правительством по вопросу повышения зарплат.",
        "id": "17db7057"
    },
    {
        "text": "The two nations are at loggerheads over trade agreements.",
        "translation": "Две страны находятся в конфликте из-за торговых соглашений.",
        "id": "5ad9fbc1"
    },
    {
        "text": "She and her best friend are at loggerheads over a misunderstanding.",
        "translation": "Она и её лучшая подруга в ссоре из-за недоразумения.",
        "id": "1e8013a7"
    },
    {
        "text": "The company’s shareholders are at loggerheads over the future direction of the business.",
        "translation": "Акционеры компании находятся в конфликте из-за будущего направления бизнеса.",
        "id": "ff89defc"
    },
    {
        "text": "The two rival gangs have been at loggerheads for years.",
        "translation": "Две соперничающие группировки уже много лет находятся в конфликте.",
        "id": "76135c97"
    },
    {
        "text": "They are at loggerheads about whether to sell the house or keep it.",
        "translation": "Они спорят о том, продавать дом или оставить его.",
        "id": "d4c69cb6"
    },
    {
        "text": "The environmentalists and the construction company are at loggerheads over the new project.",
        "translation": "Экологи и строительная компания в жестком противостоянии из-за нового проекта.",
        "id": "ab20ac34"
    },
    {
        "text": "He’s at loggerheads with his landlord over the rent increase.",
        "translation": "Он в конфликте с арендодателем из-за повышения арендной платы.",
        "id": "8674a714"
    },
    {
        "text": "The opposition party is at loggerheads with the government over the new policy.",
        "translation": "Оппозиционная партия находится в жёстком противостоянии с правительством из-за новой политики.",
        "id": "202b80e8"
    },
    {
        "text": "The parents were at loggerheads about how to discipline their child.",
        "translation": "Родители спорили о том, как воспитывать своего ребёнка.",
        "id": "2461622b"
    },
    {
        "text": "The two authors are at loggerheads over who should get credit for the book.",
        "translation": "Два автора находятся в конфликте из-за того, кому приписать авторство книги.",
        "id": "24433e8b"
    },
    {
        "text": "The mayor and the city council are at loggerheads over the budget allocation.",
        "translation": "Мэр и городской совет находятся в конфликте из-за распределения бюджета.",
        "id": "b37d4f77"
    },
    {
        "text": "She’s at loggerheads with her colleague about how to handle the project.",
        "translation": "Она в конфликте с коллегой по поводу того, как вести проект.",
        "id": "4eabe18d"
    },
    {
        "text": "The siblings were at loggerheads over who should take care of their elderly parents.",
        "translation": "Братья и сёстры спорили о том, кто должен ухаживать за пожилыми родителями.",
        "id": "2bb370e6"
    },
    {
        "text": "The two rival tech companies are at loggerheads over a patent dispute.",
        "translation": "Две конкурирующие технологические компании находятся в конфликте из-за патентного спора.",
        "id": "d032f6c8"
    }
]