[
    {
        "text": "Don't tie yourself in knots over a small mistake.",
        "translation": "Не мучайся из-за небольшой ошибки.",
        "id": "666a71e3"
    },
    {
        "text": "He tied himself up in knots trying to explain his absence.",
        "translation": "Он запутался, пытаясь объяснить своё отсутствие.",
        "id": "ef5edc1c"
    },
    {
        "text": "Whenever she has to speak in front of a crowd, she ties herself in knots.",
        "translation": "Каждый раз, когда ей нужно выступать перед публикой, она сильно нервничает.",
        "id": "92f4dbf5"
    },
    {
        "text": "Stop tying yourself in knots with endless details and focus on the main point.",
        "translation": "Хватит вдаваться в бесконечные детали и сосредоточься на самом главном.",
        "id": "543241df"
    },
    {
        "text": "I tie myself up in knots every time there's a deadline at work.",
        "translation": "Я начинаю нервничать каждый раз, когда на работе приближается дедлайн.",
        "id": "b281fe75"
    },
    {
        "text": "He tied himself in knots trying to answer all the questions at once.",
        "translation": "Он запутался, пытаясь ответить на все вопросы сразу.",
        "id": "867da446"
    },
    {
        "text": "She ties herself up in knots whenever she overthinks a simple problem.",
        "translation": "Она начинает себя накручивать, когда слишком много думает о простой задаче.",
        "id": "72f0dd95"
    },
    {
        "text": "Don't tie yourself in knots over something you can't control.",
        "translation": "Не переживай так сильно из-за того, что не можешь контролировать.",
        "id": "87cc0522"
    },
    {
        "text": "They tied themselves up in knots while discussing the project budget.",
        "translation": "Они сильно запутались, обсуждая бюджет проекта.",
        "id": "6bec61d5"
    },
    {
        "text": "He ties himself in knots thinking about what others might say.",
        "translation": "Он начинает переживать, размышляя о том, что могут сказать другие.",
        "id": "bd5b85c0"
    },
    {
        "text": "I'm tying myself in knots trying to decide which university to apply to.",
        "translation": "Я схожу с ума, пытаясь решить, в какой университет подать документы.",
        "id": "1a800292"
    },
    {
        "text": "She tied herself up in knots when she couldn't find the right words.",
        "translation": "Она запуталась, когда не смогла подобрать нужные слова.",
        "id": "c533fcfc"
    },
    {
        "text": "Don't tie yourself in knots — just do your best and move on.",
        "translation": "Не накручивай себя — просто сделай всё, что можешь, и двигайся дальше.",
        "id": "e1a900ca"
    },
    {
        "text": "He was tying himself in knots because he couldn't fix the computer problem.",
        "translation": "Он очень нервничал, так как не мог разобраться с проблемой на компьютере.",
        "id": "7a3276aa"
    },
    {
        "text": "She ties herself up in knots preparing for every exam.",
        "translation": "Она сильно волнуется, готовясь к каждому экзамену.",
        "id": "cedb2a2d"
    },
    {
        "text": "If you keep asking for everyone's opinion, you'll only tie yourself in knots.",
        "translation": "Если ты будешь спрашивать мнение у всех подряд, ты только сильнее запутаешься.",
        "id": "0d37e2b1"
    },
    {
        "text": "They tied themselves up in knots trying to meet the impossible deadline.",
        "translation": "Они очень нервничали, пытаясь уложиться в нереально сжатые сроки.",
        "id": "b0a8be02"
    },
    {
        "text": "He ties himself in knots over the smallest details at work.",
        "translation": "Он часто переживает даже из-за самых мелких деталей на работе.",
        "id": "22fb0d3b"
    },
    {
        "text": "I'm tying myself up in knots trying to choose the perfect birthday gift.",
        "translation": "Я ломаю голову, пытаясь выбрать идеальный подарок на день рождения.",
        "id": "9b67e6e0"
    },
    {
        "text": "She tied herself in knots, worried about offending her friends.",
        "translation": "Она вся извелась, боясь обидеть своих друзей.",
        "id": "9639377f"
    },
    {
        "text": "Don't tie yourself up in knots — mistakes happen, and it's okay.",
        "translation": "Не переживай так сильно — все совершают ошибки, и это нормально.",
        "id": "de6d4001"
    },
    {
        "text": "He tied himself in knots looking for a way to impress his new boss.",
        "translation": "Он очень переживал, пытаясь найти способ произвести впечатление на нового начальника.",
        "id": "7b400be4"
    },
    {
        "text": "They tie themselves up in knots every time they have to make a tough decision.",
        "translation": "Они очень нервничают, когда им нужно принять сложное решение.",
        "id": "466ef98f"
    },
    {
        "text": "I always tie myself in knots before speaking at conferences.",
        "translation": "Я всегда очень волнуюсь перед выступлениями на конференциях.",
        "id": "8ebaef28"
    },
    {
        "text": "Stop tying yourself in knots and focus on what truly matters.",
        "translation": "Перестань себя мучить и сосредоточься на том, что действительно важно.",
        "id": "f2ecadb4"
    }
]