[
    {
        "text": "I had been working at the company for five years before I decided to quit.",
        "translation": "Я работал в компании пять лет, прежде чем решил уволиться.",
        "id": "d651d2ee"
    },
    {
        "text": "She had been waiting for the bus for 30 minutes when it finally arrived.",
        "translation": "Она ждала автобус 30 минут, когда он наконец приехал.",
        "id": "233b1d25"
    },
    {
        "text": "They had been living in that house for ten years before they moved to another city.",
        "translation": "Они жили в том доме десять лет, прежде чем переехали в другой город.",
        "id": "6e18582d"
    },
    {
        "text": "We had been traveling across Europe for two months before we returned home.",
        "translation": "Мы путешествовали по Европе два месяца, прежде чем вернулись домой.",
        "id": "fdcd7e94"
    },
    {
        "text": "He had been studying for his exam all night before he finally went to bed.",
        "translation": "Он учился к экзамену всю ночь, прежде чем наконец пошел спать.",
        "id": "c039c0a6"
    },
    {
        "text": "She had been practicing the piano for years before she performed in public.",
        "translation": "Она практиковалась в игре на пианино много лет, прежде чем выступила публично.",
        "id": "9200022f"
    },
    {
        "text": "They had been playing football for an hour before it started to rain.",
        "translation": "Они играли в футбол час, прежде чем начался дождь.",
        "id": "5dd945dc"
    },
    {
        "text": "How long had you been working on this project before they canceled it?",
        "translation": "Как долго ты работал над этим проектом, прежде чем его отменили?",
        "id": "cdd14d7d"
    },
    {
        "text": "I had been driving for three hours when I decided to take a break.",
        "translation": "Я вел машину три часа, когда решил сделать перерыв.",
        "id": "20aa23bc"
    },
    {
        "text": "She had been reading that book for a week before she finished it.",
        "translation": "Она читала эту книгу неделю, прежде чем закончила её.",
        "id": "815d6d2e"
    },
    {
        "text": "They had been fixing the roof since morning when the storm hit.",
        "translation": "Они чинили крышу с утра, когда начался шторм.",
        "id": "7198cb10"
    },
    {
        "text": "We had been discussing the issue for hours before we found a solution.",
        "translation": "Мы обсуждали этот вопрос несколько часов, прежде чем нашли решение.",
        "id": "89b55ddf"
    },
    {
        "text": "He had been training for six months before he ran his first marathon.",
        "translation": "Он тренировался шесть месяцев, прежде чем пробежал свой первый марафон.",
        "id": "d43a26f4"
    },
    {
        "text": "She had been cooking dinner for an hour before the guests arrived.",
        "translation": "Она готовила ужин час, прежде чем гости приехали.",
        "id": "3061d9ca"
    },
    {
        "text": "How long had they been dating before they got married?",
        "translation": "Как долго они встречались, прежде чем поженились?",
        "id": "2faf9d29"
    },
    {
        "text": "I had been painting the walls for two days when I realized I didn’t like the color.",
        "translation": "Я красил стены два дня, когда понял, что мне не нравится цвет.",
        "id": "24c115f6"
    },
    {
        "text": "She had been learning French for five years before she moved to Paris.",
        "translation": "Она изучала французский пять лет, прежде чем переехала в Париж.",
        "id": "d34c64c5"
    },
    {
        "text": "They had been negotiating the contract for weeks before they signed it.",
        "translation": "Они обсуждали контракт несколько недель, прежде чем подписали его.",
        "id": "0f34ed0f"
    },
    {
        "text": "We had been walking for hours before we finally found a place to rest.",
        "translation": "Мы шли несколько часов, прежде чем наконец нашли место для отдыха.",
        "id": "e485ed7b"
    },
    {
        "text": "How long had you been working on your book before it was published?",
        "translation": "Как долго ты работал над своей книгой, прежде чем она была опубликована?",
        "id": "ff173fd5"
    },
    {
        "text": "He had been playing the violin since childhood before he joined the orchestra.",
        "translation": "Он играл на скрипке с детства, прежде чем присоединился к оркестру.",
        "id": "d0d79e20"
    },
    {
        "text": "She had been teaching at the school for ten years before she retired.",
        "translation": "Она преподавала в школе десять лет, прежде чем ушла на пенсию.",
        "id": "1ee8c128"
    },
    {
        "text": "They had been climbing the mountain for six hours before they reached the top.",
        "translation": "Они поднимались в гору шесть часов, прежде чем достигли вершины.",
        "id": "53c70f86"
    },
    {
        "text": "We had been working in the garden all morning before it started raining.",
        "translation": "Мы работали в саду все утро, прежде чем начался дождь.",
        "id": "ec6f6fbc"
    },
    {
        "text": "How long had she been waiting for him before he finally arrived?",
        "translation": "Как долго она ждала его, прежде чем он наконец приехал?",
        "id": "d5bdabc2"
    }
]