[
    {
        "text": "I have been working on a new project for three months.",
        "translation": "Я работаю над новым проектом уже три месяца.",
        "id": "fd428030"
    },
    {
        "text": "She has been painting her room since 8 AM.",
        "translation": "Она красит свою комнату с восьми утра.",
        "id": "975eb346"
    },
    {
        "text": "They have been running in the park for an hour.",
        "translation": "Они бегают в парке уже час.",
        "id": "9259d2ac"
    },
    {
        "text": "We have been building a treehouse for our kids for the last two weeks.",
        "translation": "Мы строим домик на дереве для наших детей последние две недели.",
        "id": "3de6b88e"
    },
    {
        "text": "He has been learning Japanese for the past year.",
        "translation": "Он изучает японский на протяжении последнего года.",
        "id": "65bb988c"
    },
    {
        "text": "I have been fixing my bike since yesterday afternoon.",
        "translation": "Я чиню свой велосипед со вчерашнего дня.",
        "id": "f6f765fc"
    },
    {
        "text": "She has been writing her novel for the last two months.",
        "translation": "Она пишет свой роман последние два месяца.",
        "id": "98919c83"
    },
    {
        "text": "They have been cooking dinner for the last hour.",
        "translation": "Они готовят ужин последний час.",
        "id": "4511a3c6"
    },
    {
        "text": "We have been training for the marathon all summer.",
        "translation": "Мы тренируемся к марафону все лето.",
        "id": "79532cbb"
    },
    {
        "text": "He has been repairing the car since this morning.",
        "translation": "Он чинит машину с сегодняшнего утра.",
        "id": "22a978e3"
    },
    {
        "text": "I have been cleaning my apartment all afternoon.",
        "translation": "Я убираю свою квартиру весь день.",
        "id": "1a4b39da"
    },
    {
        "text": "She has been organizing her books for three hours.",
        "translation": "Она раскладывает свои книги уже три часа.",
        "id": "b9485e70"
    },
    {
        "text": "They have been traveling across South America for the last six weeks.",
        "translation": "Они путешествуют по Южной Америке последние шесть недель.",
        "id": "001b2b05"
    },
    {
        "text": "We have been practicing our dance routine every evening for a month.",
        "translation": "Мы тренируем наш танец каждый вечер уже месяц.",
        "id": "07d2fa91"
    },
    {
        "text": "He has been watering the plants since sunrise.",
        "translation": "Он поливает растения с восхода солнца.",
        "id": "3d154f22"
    },
    {
        "text": "I have been working out at the gym for the last two months.",
        "translation": "Я занимаюсь в спортзале последние два месяца.",
        "id": "c2071b38"
    },
    {
        "text": "She has been teaching at the university since 2018.",
        "translation": "Она преподает в университете с 2018 года.",
        "id": "bc28544e"
    },
    {
        "text": "They have been designing a new website for their company for five months.",
        "translation": "Они разрабатывают новый сайт для своей компании уже пять месяцев.",
        "id": "5e69fc06"
    },
    {
        "text": "We have been hiking in the mountains since early morning.",
        "translation": "Мы ходим в поход в горах с раннего утра.",
        "id": "8f60f0d6"
    },
    {
        "text": "He has been painting a beautiful landscape all day.",
        "translation": "Он рисует красивый пейзаж весь день.",
        "id": "e7e31dc6"
    },
    {
        "text": "I have been preparing for my exam since last week.",
        "translation": "Я готовлюсь к экзамену с прошлой недели.",
        "id": "eb0570eb"
    },
    {
        "text": "She has been sewing a dress for her sister for the past few hours.",
        "translation": "Она шьет платье для своей сестры последние несколько часов.",
        "id": "776b44e3"
    },
    {
        "text": "They have been filming a documentary about wildlife for two months.",
        "translation": "Они снимают документальный фильм о дикой природе уже два месяца.",
        "id": "98826397"
    },
    {
        "text": "We have been collecting old coins for many years.",
        "translation": "Мы собираем старинные монеты уже много лет.",
        "id": "3531efdb"
    },
    {
        "text": "He has been jogging in the park every morning for three months.",
        "translation": "Он бегает в парке каждое утро уже три месяца.",
        "id": "10c2d874"
    }
]