[
    {
        "text": "If I had studied harder, I would have passed the exam.",
        "translation": "Если бы я учился усерднее, я бы сдал экзамен.",
        "id": "388665b2"
    },
    {
        "text": "If she had left earlier, she wouldn’t have missed the train.",
        "translation": "Если бы она вышла раньше, она бы не опоздала на поезд.",
        "id": "d0b9b64b"
    },
    {
        "text": "If they had invited me, I would have gone to the party.",
        "translation": "Если бы они меня пригласили, я бы пошел на вечеринку.",
        "id": "de191646"
    },
    {
        "text": "If he had driven more carefully, he wouldn’t have crashed his car.",
        "translation": "Если бы он ехал осторожнее, он бы не разбил свою машину.",
        "id": "b99b476c"
    },
    {
        "text": "If we had brought a map, we wouldn’t have gotten lost.",
        "translation": "Если бы мы взяли карту, мы бы не заблудились.",
        "id": "03d97a03"
    },
    {
        "text": "If I had known about the meeting, I would have attended it.",
        "translation": "Если бы я знал о встрече, я бы пришел на нее.",
        "id": "350bf11c"
    },
    {
        "text": "If she had prepared better, she would have won the competition.",
        "translation": "Если бы она подготовилась лучше, она бы выиграла соревнование.",
        "id": "ee7de3d4"
    },
    {
        "text": "If they had trained harder, they would have won the match.",
        "translation": "Если бы они тренировались усерднее, они бы выиграли матч.",
        "id": "812bb027"
    },
    {
        "text": "If I had saved more money, I could have bought that house.",
        "translation": "Если бы я накопил больше денег, я мог бы купить тот дом.",
        "id": "4388963e"
    },
    {
        "text": "If he had apologized, she wouldn’t have been so upset.",
        "translation": "Если бы он извинился, она бы не была так расстроена.",
        "id": "960c3de5"
    },
    {
        "text": "Unless he had helped me, I wouldn’t have finished the project on time.",
        "translation": "Если бы он мне не помог, я бы не закончил проект вовремя.",
        "id": "768dcc63"
    },
    {
        "text": "If you had listened to me, you wouldn’t have made that mistake.",
        "translation": "Если бы ты меня послушал, ты бы не сделал ту ошибку.",
        "id": "73bebdea"
    },
    {
        "text": "If I had taken the job offer, I would have been working in New York.",
        "translation": "Если бы я принял предложение о работе, я бы сейчас работал в Нью-Йорке.",
        "id": "6d9b6550"
    },
    {
        "text": "If she had worn a jacket, she wouldn’t have caught a cold.",
        "translation": "Если бы она надела куртку, она бы не простудилась.",
        "id": "f6608854"
    },
    {
        "text": "If we had checked the weather forecast, we wouldn’t have gone out.",
        "translation": "Если бы мы проверили прогноз погоды, мы бы не выходили.",
        "id": "fcc80731"
    },
    {
        "text": "Provided that he had worked harder, he might have been promoted.",
        "translation": "При условии, что он работал бы усерднее, его могли бы повысить.",
        "id": "a5dd8fb6"
    },
    {
        "text": "If you had left earlier, you wouldn’t have been late.",
        "translation": "Если бы ты вышел раньше, ты бы не опоздал.",
        "id": "d68f8007"
    },
    {
        "text": "If they had asked for directions, they wouldn’t have gotten lost.",
        "translation": "Если бы они спросили дорогу, они бы не заблудились.",
        "id": "0437376c"
    },
    {
        "text": "If I had studied engineering, I would have become an architect.",
        "translation": "Если бы я изучал инженерное дело, я бы стал архитектором.",
        "id": "e5d6824b"
    },
    {
        "text": "Supposing you had won the lottery, what would you have done?",
        "translation": "Предположим, ты бы выиграл в лотерею, что бы ты сделал?",
        "id": "bf7ece3a"
    },
    {
        "text": "If we had brought enough food, we wouldn’t have been hungry.",
        "translation": "Если бы мы взяли достаточно еды, мы бы не были голодны.",
        "id": "5af5ffba"
    },
    {
        "text": "If I had set my alarm, I wouldn’t have overslept.",
        "translation": "Если бы я поставил будильник, я бы не проспал.",
        "id": "9704df9a"
    },
    {
        "text": "If they had taken a taxi, they would have arrived earlier.",
        "translation": "Если бы они взяли такси, они бы приехали раньше.",
        "id": "49a15e77"
    },
    {
        "text": "If you had worn sunscreen, you wouldn’t have gotten sunburned.",
        "translation": "Если бы ты использовал солнцезащитный крем, ты бы не обгорел.",
        "id": "ddf8854d"
    },
    {
        "text": "On condition that you had studied harder, you would have passed the test.",
        "translation": "При условии, что ты учился бы усерднее, ты бы сдал тест.",
        "id": "42fa6e98"
    }
]